zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define MAU_RES_STATUS_RES3_NX_MASK              (0x1000000U)
#define MAU_RES_STATUS_RES3_NX_SHIFT             (24U)
/*! RES3_NX - RES3 IEEE Inexact Flag
 *  0b0..The result is not rounded.
 *  0b1..The result is rounded, and as a result some digits lost.
 */
#define MAU_RES_STATUS_RES3_NX(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_NX_SHIFT)) & MAU_RES_STATUS_RES3_NX_MASK)

#define MAU_RES_STATUS_RES3_UF_MASK              (0x2000000U)
#define MAU_RES_STATUS_RES3_UF_SHIFT             (25U)
/*! RES3_UF - RES3 IEEE Underflow Flag
 *  0b0..No tiny non-zero result is detected.
 *  0b1..A tiny non-zero result is detected.
 */
#define MAU_RES_STATUS_RES3_UF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_UF_SHIFT)) & MAU_RES_STATUS_RES3_UF_MASK)

#define MAU_RES_STATUS_RES3_OF_MASK              (0x4000000U)
#define MAU_RES_STATUS_RES3_OF_SHIFT             (26U)
/*! RES3_OF - RES3 IEEE Overflow Flag
 *  0b0..The result format's largest finite number is not exceeded.
 *  0b1..The result format's largest finite number is exceeded.
 */
#define MAU_RES_STATUS_RES3_OF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_OF_SHIFT)) & MAU_RES_STATUS_RES3_OF_MASK)

#define MAU_RES_STATUS_RES3_DZ_MASK              (0x8000000U)
#define MAU_RES_STATUS_RES3_DZ_SHIFT             (27U)
/*! RES3_DZ - RES3 IEEE Divide by Zero Flag
 *  0b0..No exact infinite result is defined for an operation on finite operands.
 *  0b1..An exact infinite result is defined for an operation on finite operands.
 */
#define MAU_RES_STATUS_RES3_DZ(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_DZ_SHIFT)) & MAU_RES_STATUS_RES3_DZ_MASK)

#define MAU_RES_STATUS_RES3_NV_MASK              (0x10000000U)
#define MAU_RES_STATUS_RES3_NV_SHIFT             (28U)
/*! RES3_NV - RES3 IEEE Invalid Flag
 *  0b0..There is usefully definable result.
 *  0b1..There is no usefully definable result.
 */
#define MAU_RES_STATUS_RES3_NV(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_NV_SHIFT)) & MAU_RES_STATUS_RES3_NV_MASK)

#define MAU_RES_STATUS_RES3_ERR_MASK             (0x20000000U)
#define MAU_RES_STATUS_RES3_ERR_SHIFT            (29U)
/*! RES3_ERR - RES3 Indirect Operation Error Flag
 *  0b0..No invalid indirect operation is detected.
 *  0b1..An invalid indirect operation error is detected.
 */
#define MAU_RES_STATUS_RES3_ERR(x)               (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_ERR_SHIFT)) & MAU_RES_STATUS_RES3_ERR_MASK)

#define MAU_RES_STATUS_RES3_OVWR_MASK            (0x40000000U)
#define MAU_RES_STATUS_RES3_OVWR_SHIFT           (30U)
/*! RES3_OVWR - RES3 Overwrite Flag
 *  0b0..The value of RES3 has been read.
 *  0b1..The value of RES3 has not been read yet and is overwritten by a new MAUWRAP result.
 */
#define MAU_RES_STATUS_RES3_OVWR(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_OVWR_SHIFT)) & MAU_RES_STATUS_RES3_OVWR_MASK)

#define MAU_RES_STATUS_RES3_FULL_MASK            (0x80000000U)
#define MAU_RES_STATUS_RES3_FULL_SHIFT           (31U)
/*! RES3_FULL - RES3 Full Flag
 *  0b0..RES3 has not updated and cannot be read.
 *  0b1..RES3 has updated and can be read.
 */
#define MAU_RES_STATUS_RES3_FULL(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_FULL_SHIFT)) & MAU_RES_STATUS_RES3_FULL_MASK)
/*! @} */

/*! @name RES0 - Result Register 0 */
/*! @{ */

#define MAU_RES0_MAU_RES0_MASK                   (0xFFFFFFFFU)
#define MAU_RES0_MAU_RES0_SHIFT                  (0U)
/*! MAU_RES0 - MAUWRAP Result Register 0 */
#define MAU_RES0_MAU_RES0(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES0_MAU_RES0_SHIFT)) & MAU_RES0_MAU_RES0_MASK)
/*! @} */

/*! @name RES1 - Result Register 1 */
/*! @{ */

#define MAU_RES1_MAU_RES1_MASK                   (0xFFFFFFFFU)
#define MAU_RES1_MAU_RES1_SHIFT                  (0U)
/*! MAU_RES1 - MAUWRAP Result Register 1 */
#define MAU_RES1_MAU_RES1(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES1_MAU_RES1_SHIFT)) & MAU_RES1_MAU_RES1_MASK)
/*! @} */

/*! @name RES2 - Result Register 2 */
/*! @{ */

#define MAU_RES2_MAU_RES2_MASK                   (0xFFFFFFFFU)
#define MAU_RES2_MAU_RES2_SHIFT                  (0U)
/*! MAU_RES2 - MAUWRAP Result Register 2 */
#define MAU_RES2_MAU_RES2(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES2_MAU_RES2_SHIFT)) & MAU_RES2_MAU_RES2_MASK)
/*! @} */

/*! @name RES3 - Result Register 3 */
/*! @{ */

#define MAU_RES3_MAU_RES3_MASK                   (0xFFFFFFFFU)
#define MAU_RES3_MAU_RES3_SHIFT                  (0U)
/*! MAU_RES3 - MAUWRAP Result Register 3 */
#define MAU_RES3_MAU_RES3(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES3_MAU_RES3_SHIFT)) & MAU_RES3_MAU_RES3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MAU_Register_Masks */


/* MAU - Peripheral instance base addresses */
/** Peripheral MAU0 base address */
#define MAU0_BASE                                (0x40108000u)
/** Peripheral MAU0 base pointer */
#define MAU0                                     ((MAU_Type *)MAU0_BASE)
/** Array initializer of MAU peripheral base addresses */
#define MAU_BASE_ADDRS                           { MAU0_BASE }
/** Array initializer of MAU peripheral base pointers */
#define MAU_BASE_PTRS                            { MAU0 }
/** Interrupt vectors for the MAU peripheral type */
#define MAU_IRQS                                 { MAU_IRQn }

/*!
 * @}
 */ /* end of group MAU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MRCC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MRCC_Peripheral_Access_Layer MRCC Peripheral Access Layer
 * @{
 */

/** MRCC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MRCC_GLB_RST0;                     /**< Peripheral Reset Control 0, offset: 0x0 */
  __O  uint32_t MRCC_GLB_RST0_SET;                 /**< Peripheral Reset Control Set 0, offset: 0x4 */
  __O  uint32_t MRCC_GLB_RST0_CLR;                 /**< Peripheral Reset Control Clear 0, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t MRCC_GLB_RST1;                     /**< Peripheral Reset Control 1, offset: 0x10 */
  __O  uint32_t MRCC_GLB_RST1_SET;                 /**< Peripheral Reset Control Set 1, offset: 0x14 */
  __O  uint32_t MRCC_GLB_RST1_CLR;                 /**< Peripheral Reset Control Clear 1, offset: 0x18 */
       uint8_t RESERVED_1[4];
  __IO uint32_t MRCC_GLB_RST2;                     /**< Peripheral Reset Control 2, offset: 0x20 */
  __O  uint32_t MRCC_GLB_RST2_SET;                 /**< Peripheral Reset Control Set 2, offset: 0x24 */
  __O  uint32_t MRCC_GLB_RST2_CLR;                 /**< Peripheral Reset Control Clear 2, offset: 0x28 */
       uint8_t RESERVED_2[20];
  __IO uint32_t MRCC_GLB_CC0;                      /**< AHB Clock Control 0, offset: 0x40 */
  __O  uint32_t MRCC_GLB_CC0_SET;                  /**< AHB Clock Control Set 0, offset: 0x44 */
  __O  uint32_t MRCC_GLB_CC0_CLR;                  /**< AHB Clock Control Clear 0, offset: 0x48 */
       uint8_t RESERVED_3[4];
  __IO uint32_t MRCC_GLB_CC1;                      /**< AHB Clock Control 1, offset: 0x50 */
  __O  uint32_t MRCC_GLB_CC1_SET;                  /**< AHB Clock Control Set 1, offset: 0x54 */
  __O  uint32_t MRCC_GLB_CC1_CLR;                  /**< AHB Clock Control Clear 1, offset: 0x58 */
       uint8_t RESERVED_4[4];
  __IO uint32_t MRCC_GLB_CC2;                      /**< AHB Clock Control 2, offset: 0x60 */
  __O  uint32_t MRCC_GLB_CC2_SET;                  /**< AHB Clock Control Set 2, offset: 0x64 */
  __O  uint32_t MRCC_GLB_CC2_CLR;                  /**< AHB Clock Control Clear 2, offset: 0x68 */
       uint8_t RESERVED_5[20];
  __IO uint32_t MRCC_GLB_ACC0;                     /**< Control Automatic Clock Gating 0, offset: 0x80 */
  __IO uint32_t MRCC_GLB_ACC1;                     /**< Control Automatic Clock Gating 1, offset: 0x84 */
  __IO uint32_t MRCC_GLB_ACC2;                     /**< Control Automatic Clock Gating 2, offset: 0x88 */
       uint8_t RESERVED_6[20];
  __IO uint32_t MRCC_I3C0_FCLK_CLKSEL;             /**< I3C0_FCLK clock selection control, offset: 0xA0 */
  __IO uint32_t MRCC_I3C0_FCLK_CLKDIV;             /**< I3C0_FCLK clock divider control, offset: 0xA4 */
  __IO uint32_t MRCC_CTIMER0_CLKSEL;               /**< CTIMER0 clock selection control, offset: 0xA8 */
  __IO uint32_t MRCC_CTIMER0_CLKDIV;               /**< CTIMER0 clock divider control, offset: 0xAC */
  __IO uint32_t MRCC_CTIMER1_CLKSEL;               /**< CTIMER1 clock selection control, offset: 0xB0 */
  __IO uint32_t MRCC_CTIMER1_CLKDIV;               /**< CTIMER1 clock divider control, offset: 0xB4 */
  __IO uint32_t MRCC_CTIMER2_CLKSEL;               /**< CTIMER2 clock selection control, offset: 0xB8 */
  __IO uint32_t MRCC_CTIMER2_CLKDIV;               /**< CTIMER2 clock divider control, offset: 0xBC */
  __IO uint32_t MRCC_CTIMER3_CLKSEL;               /**< CTIMER3 clock selection control, offset: 0xC0 */
  __IO uint32_t MRCC_CTIMER3_CLKDIV;               /**< CTIMER3 clock divider control, offset: 0xC4 */
  __IO uint32_t MRCC_CTIMER4_CLKSEL;               /**< CTIMER4 clock selection control, offset: 0xC8 */
  __IO uint32_t MRCC_CTIMER4_CLKDIV;               /**< CTIMER4 clock divider control, offset: 0xCC */
       uint8_t RESERVED_7[4];
  __IO uint32_t MRCC_WWDT0_CLKDIV;                 /**< WWDT0 clock divider control, offset: 0xD4 */
  __IO uint32_t MRCC_FLEXIO0_CLKSEL;               /**< FLEXIO0 clock selection control, offset: 0xD8 */
  __IO uint32_t MRCC_FLEXIO0_CLKDIV;               /**< FLEXIO0 clock divider control, offset: 0xDC */
  __IO uint32_t MRCC_LPI2C0_CLKSEL;                /**< LPI2C0 clock selection control, offset: 0xE0 */
  __IO uint32_t MRCC_LPI2C0_CLKDIV;                /**< LPI2C0 clock divider control, offset: 0xE4 */
  __IO uint32_t MRCC_LPI2C1_CLKSEL;                /**< LPI2C1 clock selection control, offset: 0xE8 */
  __IO uint32_t MRCC_LPI2C1_CLKDIV;                /**< LPI2C1 clock divider control, offset: 0xEC */
  __IO uint32_t MRCC_LPSPI0_CLKSEL;                /**< LPSPI0 clock selection control, offset: 0xF0 */
  __IO uint32_t MRCC_LPSPI0_CLKDIV;                /**< LPSPI0 clock divider control, offset: 0xF4 */
  __IO uint32_t MRCC_LPSPI1_CLKSEL;                /**< LPSPI1 clock selection control, offset: 0xF8 */
  __IO uint32_t MRCC_LPSPI1_CLKDIV;                /**< LPSPI1 clock divider control, offset: 0xFC */
  __IO uint32_t MRCC_LPUART0_CLKSEL;               /**< LPUART0 clock selection control, offset: 0x100 */
  __IO uint32_t MRCC_LPUART0_CLKDIV;               /**< LPUART0 clock divider control, offset: 0x104 */
  __IO uint32_t MRCC_LPUART1_CLKSEL;               /**< LPUART1 clock selection control, offset: 0x108 */
  __IO uint32_t MRCC_LPUART1_CLKDIV;               /**< LPUART1 clock divider control, offset: 0x10C */
  __IO uint32_t MRCC_LPUART2_CLKSEL;               /**< LPUART2 clock selection control, offset: 0x110 */
  __IO uint32_t MRCC_LPUART2_CLKDIV;               /**< LPUART2 clock divider control, offset: 0x114 */
  __IO uint32_t MRCC_LPUART3_CLKSEL;               /**< LPUART3 clock selection control, offset: 0x118 */
  __IO uint32_t MRCC_LPUART3_CLKDIV;               /**< LPUART3 clock divider control, offset: 0x11C */
  __IO uint32_t MRCC_LPUART4_CLKSEL;               /**< LPUART4 clock selection control, offset: 0x120 */
  __IO uint32_t MRCC_LPUART4_CLKDIV;               /**< LPUART4 clock divider control, offset: 0x124 */
  __IO uint32_t MRCC_USB0_CLKSEL;                  /**< USB0 clock selection control, offset: 0x128 */
  __IO uint32_t MRCC_USB0_CLKDIV;                  /**< USB0 clock divider control, offset: 0x12C */
  __IO uint32_t MRCC_LPTMR0_CLKSEL;                /**< LPTMR0 clock selection control, offset: 0x130 */
  __IO uint32_t MRCC_LPTMR0_CLKDIV;                /**< LPTMR0 clock divider control, offset: 0x134 */
  __IO uint32_t MRCC_OSTIMER0_CLKSEL;              /**< OSTIMER0 clock selection control, offset: 0x138 */
       uint8_t RESERVED_8[4];
  __IO uint32_t MRCC_ADC_CLKSEL;                   /**< ADCx clock selection control, offset: 0x140 */
  __IO uint32_t MRCC_ADC_CLKDIV;                   /**< ADCx clock divider control, offset: 0x144 */
       uint8_t RESERVED_9[4];
  __IO uint32_t MRCC_CMP0_FUNC_CLKDIV;             /**< CMP0_FUNC clock divider control, offset: 0x14C */
  __IO uint32_t MRCC_CMP0_RR_CLKSEL;               /**< CMP0_RR clock selection control, offset: 0x150 */
  __IO uint32_t MRCC_CMP0_RR_CLKDIV;               /**< CMP0_RR clock divider control, offset: 0x154 */
       uint8_t RESERVED_10[4];
  __IO uint32_t MRCC_CMP1_FUNC_CLKDIV;             /**< CMP1_FUNC clock divider control, offset: 0x15C */
  __IO uint32_t MRCC_CMP1_RR_CLKSEL;               /**< CMP1_RR clock selection control, offset: 0x160 */
  __IO uint32_t MRCC_CMP1_RR_CLKDIV;               /**< CMP1_RR clock divider control, offset: 0x164 */
       uint8_t RESERVED_11[4];
  __IO uint32_t MRCC_CMP2_FUNC_CLKDIV;             /**< CMP2_FUNC clock divider control, offset: 0x16C */
  __IO uint32_t MRCC_CMP2_RR_CLKSEL;               /**< CMP2_RR clock selection control, offset: 0x170 */
  __IO uint32_t MRCC_CMP2_RR_CLKDIV;               /**< CMP2_RR clock divider control, offset: 0x174 */
  __IO uint32_t MRCC_DAC0_CLKSEL;                  /**< DAC0 clock selection control, offset: 0x178 */
  __IO uint32_t MRCC_DAC0_CLKDIV;                  /**< DAC0 clock divider control, offset: 0x17C */
  __IO uint32_t MRCC_FLEXCAN0_CLKSEL;              /**< FLEXCAN0 clock selection control, offset: 0x180 */
  __IO uint32_t MRCC_FLEXCAN0_CLKDIV;              /**< FLEXCAN0 clock divider control, offset: 0x184 */
  __IO uint32_t MRCC_FLEXCAN1_CLKSEL;              /**< FLEXCAN1 clock selection control, offset: 0x188 */
  __IO uint32_t MRCC_FLEXCAN1_CLKDIV;              /**< FLEXCAN1 clock divider control, offset: 0x18C */
  __IO uint32_t MRCC_LPI2C2_CLKSEL;                /**< LPI2C2 clock selection control, offset: 0x190 */
  __IO uint32_t MRCC_LPI2C2_CLKDIV;                /**< LPI2C2 clock divider control, offset: 0x194 */
  __IO uint32_t MRCC_LPI2C3_CLKSEL;                /**< LPI2C3 clock selection control, offset: 0x198 */
  __IO uint32_t MRCC_LPI2C3_CLKDIV;                /**< LPI2C3 clock divider control, offset: 0x19C */
  __IO uint32_t MRCC_LPUART5_CLKSEL;               /**< LPUART5 clock selection control, offset: 0x1A0 */
  __IO uint32_t MRCC_LPUART5_CLKDIV;               /**< LPUART5 clock divider control, offset: 0x1A4 */
  __IO uint32_t MRCC_DBG_TRACE_CLKSEL;             /**< DBG_TRACE clock selection control, offset: 0x1A8 */
  __IO uint32_t MRCC_DBG_TRACE_CLKDIV;             /**< DBG_TRACE clock divider control, offset: 0x1AC */
  __IO uint32_t MRCC_CLKOUT_CLKSEL;                /**< CLKOUT clock selection control, offset: 0x1B0 */
  __IO uint32_t MRCC_CLKOUT_CLKDIV;                /**< CLKOUT clock divider control, offset: 0x1B4 */
  __IO uint32_t MRCC_SYSTICK_CLKSEL;               /**< SYSTICK clock selection control, offset: 0x1B8 */
  __IO uint32_t MRCC_SYSTICK_CLKDIV;               /**< SYSTICK clock divider control, offset: 0x1BC */
} MRCC_Type;

/* ----------------------------------------------------------------------------
   -- MRCC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MRCC_Register_Masks MRCC Register Masks
 * @{
 */

/*! @name MRCC_GLB_RST0 - Peripheral Reset Control 0 */
/*! @{ */

#define MRCC_MRCC_GLB_RST0_INPUTMUX0_MASK        (0x1U)
#define MRCC_MRCC_GLB_RST0_INPUTMUX0_SHIFT       (0U)
/*! INPUTMUX0 - INPUTMUX0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST0_INPUTMUX0(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST0_INPUTMUX0_SHIFT)) & MRCC_MRCC_GLB_RST0_INPUTMUX0_MASK)

#define MRCC_MRCC_GLB_RST0_I3C0_MASK             (0x2U)
#define MRCC_MRCC_GLB_RST0_I3C0_SHIFT            (1U)
/*! I3C0 - I3C0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST0_I3C0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST0_I3C0_SHIFT)) & MRCC_MRCC_GLB_RST0_I3C0_MASK)

#define MRCC_MRCC_GLB_RST0_CTIMER0_MASK          (0x4U)
#define MRCC_MRCC_GLB_RST0_CTIMER0_SHIFT         (2U)
/*! CTIMER0 - CTIMER0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST0_CTIMER0(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST0_CTIMER0_SHIFT)) & MRCC_MRCC_GLB_RST0_CTIMER0_MASK)

#define MRCC_MRCC_GLB_RST0_CTIMER1_MASK          (0x8U)
#define MRCC_MRCC_GLB_RST0_CTIMER1_SHIFT         (3U)
/*! CTIMER1 - CTIMER1
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST0_CTIMER1(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST0_CTIMER1_SHIFT)) & MRCC_MRCC_GLB_RST0_CTIMER1_MASK)

