zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define MRCC_MRCC_GLB_CC1_CMP0_MASK              (0x10U)
#define MRCC_MRCC_GLB_CC1_CMP0_SHIFT             (4U)
/*! CMP0 - CMP0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_CMP0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_CMP0_SHIFT)) & MRCC_MRCC_GLB_CC1_CMP0_MASK)

#define MRCC_MRCC_GLB_CC1_CMP1_MASK              (0x20U)
#define MRCC_MRCC_GLB_CC1_CMP1_SHIFT             (5U)
/*! CMP1 - CMP1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_CMP1(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_CMP1_SHIFT)) & MRCC_MRCC_GLB_CC1_CMP1_MASK)

#define MRCC_MRCC_GLB_CC1_CMP2_MASK              (0x40U)
#define MRCC_MRCC_GLB_CC1_CMP2_SHIFT             (6U)
/*! CMP2 - CMP2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_CMP2(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_CMP2_SHIFT)) & MRCC_MRCC_GLB_CC1_CMP2_MASK)

#define MRCC_MRCC_GLB_CC1_DAC0_MASK              (0x80U)
#define MRCC_MRCC_GLB_CC1_DAC0_SHIFT             (7U)
/*! DAC0 - DAC0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_DAC0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_DAC0_SHIFT)) & MRCC_MRCC_GLB_CC1_DAC0_MASK)

#define MRCC_MRCC_GLB_CC1_OPAMP0_MASK            (0x100U)
#define MRCC_MRCC_GLB_CC1_OPAMP0_SHIFT           (8U)
/*! OPAMP0 - OPAMP0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_OPAMP0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_OPAMP0_SHIFT)) & MRCC_MRCC_GLB_CC1_OPAMP0_MASK)

#define MRCC_MRCC_GLB_CC1_OPAMP1_MASK            (0x200U)
#define MRCC_MRCC_GLB_CC1_OPAMP1_SHIFT           (9U)
/*! OPAMP1 - OPAMP1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_OPAMP1(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_OPAMP1_SHIFT)) & MRCC_MRCC_GLB_CC1_OPAMP1_MASK)

#define MRCC_MRCC_GLB_CC1_OPAMP2_MASK            (0x400U)
#define MRCC_MRCC_GLB_CC1_OPAMP2_SHIFT           (10U)
/*! OPAMP2 - OPAMP2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_OPAMP2(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_OPAMP2_SHIFT)) & MRCC_MRCC_GLB_CC1_OPAMP2_MASK)

#define MRCC_MRCC_GLB_CC1_OPAMP3_MASK            (0x800U)
#define MRCC_MRCC_GLB_CC1_OPAMP3_SHIFT           (11U)
/*! OPAMP3 - OPAMP3
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_OPAMP3(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_OPAMP3_SHIFT)) & MRCC_MRCC_GLB_CC1_OPAMP3_MASK)

#define MRCC_MRCC_GLB_CC1_PORT0_MASK             (0x1000U)
#define MRCC_MRCC_GLB_CC1_PORT0_SHIFT            (12U)
/*! PORT0 - PORT0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_PORT0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_PORT0_SHIFT)) & MRCC_MRCC_GLB_CC1_PORT0_MASK)

#define MRCC_MRCC_GLB_CC1_PORT1_MASK             (0x2000U)
#define MRCC_MRCC_GLB_CC1_PORT1_SHIFT            (13U)
/*! PORT1 - PORT1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_PORT1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_PORT1_SHIFT)) & MRCC_MRCC_GLB_CC1_PORT1_MASK)

#define MRCC_MRCC_GLB_CC1_PORT2_MASK             (0x4000U)
#define MRCC_MRCC_GLB_CC1_PORT2_SHIFT            (14U)
/*! PORT2 - PORT2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_PORT2(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_PORT2_SHIFT)) & MRCC_MRCC_GLB_CC1_PORT2_MASK)

#define MRCC_MRCC_GLB_CC1_PORT3_MASK             (0x8000U)
#define MRCC_MRCC_GLB_CC1_PORT3_SHIFT            (15U)
/*! PORT3 - PORT3
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_PORT3(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_PORT3_SHIFT)) & MRCC_MRCC_GLB_CC1_PORT3_MASK)

#define MRCC_MRCC_GLB_CC1_PORT4_MASK             (0x10000U)
#define MRCC_MRCC_GLB_CC1_PORT4_SHIFT            (16U)
/*! PORT4 - PORT4
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_PORT4(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_PORT4_SHIFT)) & MRCC_MRCC_GLB_CC1_PORT4_MASK)

#define MRCC_MRCC_GLB_CC1_SLCD0_MASK             (0x20000U)
#define MRCC_MRCC_GLB_CC1_SLCD0_SHIFT            (17U)
/*! SLCD0 - SLCD0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_SLCD0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_SLCD0_SHIFT)) & MRCC_MRCC_GLB_CC1_SLCD0_MASK)

#define MRCC_MRCC_GLB_CC1_FLEXCAN0_MASK          (0x40000U)
#define MRCC_MRCC_GLB_CC1_FLEXCAN0_SHIFT         (18U)
/*! FLEXCAN0 - FLEXCAN0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_FLEXCAN0(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_FLEXCAN0_SHIFT)) & MRCC_MRCC_GLB_CC1_FLEXCAN0_MASK)

#define MRCC_MRCC_GLB_CC1_FLEXCAN1_MASK          (0x80000U)
#define MRCC_MRCC_GLB_CC1_FLEXCAN1_SHIFT         (19U)
/*! FLEXCAN1 - FLEXCAN1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_FLEXCAN1(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_FLEXCAN1_SHIFT)) & MRCC_MRCC_GLB_CC1_FLEXCAN1_MASK)

#define MRCC_MRCC_GLB_CC1_LPI2C2_MASK            (0x100000U)
#define MRCC_MRCC_GLB_CC1_LPI2C2_SHIFT           (20U)
/*! LPI2C2 - LPI2C2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_LPI2C2(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_LPI2C2_SHIFT)) & MRCC_MRCC_GLB_CC1_LPI2C2_MASK)

#define MRCC_MRCC_GLB_CC1_LPI2C3_MASK            (0x200000U)
#define MRCC_MRCC_GLB_CC1_LPI2C3_SHIFT           (21U)
/*! LPI2C3 - LPI2C3
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_LPI2C3(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_LPI2C3_SHIFT)) & MRCC_MRCC_GLB_CC1_LPI2C3_MASK)

#define MRCC_MRCC_GLB_CC1_LPUART5_MASK           (0x400000U)
#define MRCC_MRCC_GLB_CC1_LPUART5_SHIFT          (22U)
/*! LPUART5 - LPUART5
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_LPUART5(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_LPUART5_SHIFT)) & MRCC_MRCC_GLB_CC1_LPUART5_MASK)

#define MRCC_MRCC_GLB_CC1_TDET0_MASK             (0x800000U)
#define MRCC_MRCC_GLB_CC1_TDET0_SHIFT            (23U)
/*! TDET0 - TDET0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_TDET0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_TDET0_SHIFT)) & MRCC_MRCC_GLB_CC1_TDET0_MASK)

