zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define MRCC_MRCC_GLB_CC1_PKC0_MASK              (0x1000000U)
#define MRCC_MRCC_GLB_CC1_PKC0_SHIFT             (24U)
/*! PKC0 - PKC0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_PKC0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_PKC0_SHIFT)) & MRCC_MRCC_GLB_CC1_PKC0_MASK)

#define MRCC_MRCC_GLB_CC1_SGI0_MASK              (0x2000000U)
#define MRCC_MRCC_GLB_CC1_SGI0_SHIFT             (25U)
/*! SGI0 - SGI0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_SGI0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_SGI0_SHIFT)) & MRCC_MRCC_GLB_CC1_SGI0_MASK)

#define MRCC_MRCC_GLB_CC1_TRNG0_MASK             (0x4000000U)
#define MRCC_MRCC_GLB_CC1_TRNG0_SHIFT            (26U)
/*! TRNG0 - TRNG0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_TRNG0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_TRNG0_SHIFT)) & MRCC_MRCC_GLB_CC1_TRNG0_MASK)

#define MRCC_MRCC_GLB_CC1_UDF0_MASK              (0x8000000U)
#define MRCC_MRCC_GLB_CC1_UDF0_SHIFT             (27U)
/*! UDF0 - UDF0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_UDF0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_UDF0_SHIFT)) & MRCC_MRCC_GLB_CC1_UDF0_MASK)

#define MRCC_MRCC_GLB_CC1_ADC2_MASK              (0x10000000U)
#define MRCC_MRCC_GLB_CC1_ADC2_SHIFT             (28U)
/*! ADC2 - ADC2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_ADC2(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_ADC2_SHIFT)) & MRCC_MRCC_GLB_CC1_ADC2_MASK)

#define MRCC_MRCC_GLB_CC1_ADC3_MASK              (0x20000000U)
#define MRCC_MRCC_GLB_CC1_ADC3_SHIFT             (29U)
/*! ADC3 - ADC3
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_ADC3(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_ADC3_SHIFT)) & MRCC_MRCC_GLB_CC1_ADC3_MASK)
/*! @} */

/*! @name MRCC_GLB_CC1_SET - AHB Clock Control Set 1 */
/*! @{ */

#define MRCC_MRCC_GLB_CC1_SET_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC1_SET_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC1_SET_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_CC1_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC1_CLR - AHB Clock Control Clear 1 */
/*! @{ */

#define MRCC_MRCC_GLB_CC1_CLR_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC1_CLR_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC1_CLR_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_CC1_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC2 - AHB Clock Control 2 */
/*! @{ */

#define MRCC_MRCC_GLB_CC2_RAMA_MASK              (0x2U)
#define MRCC_MRCC_GLB_CC2_RAMA_SHIFT             (1U)
/*! RAMA - RAMA
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_RAMA(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_RAMA_SHIFT)) & MRCC_MRCC_GLB_CC2_RAMA_MASK)

#define MRCC_MRCC_GLB_CC2_RAMB_MASK              (0x4U)
#define MRCC_MRCC_GLB_CC2_RAMB_SHIFT             (2U)
/*! RAMB - RAMB
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_RAMB(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_RAMB_SHIFT)) & MRCC_MRCC_GLB_CC2_RAMB_MASK)

#define MRCC_MRCC_GLB_CC2_RAMC_MASK              (0x8U)
#define MRCC_MRCC_GLB_CC2_RAMC_SHIFT             (3U)
/*! RAMC - RAMC
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_RAMC(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_RAMC_SHIFT)) & MRCC_MRCC_GLB_CC2_RAMC_MASK)

#define MRCC_MRCC_GLB_CC2_GPIO0_MASK             (0x10U)
#define MRCC_MRCC_GLB_CC2_GPIO0_SHIFT            (4U)
/*! GPIO0 - GPIO0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_GPIO0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_GPIO0_SHIFT)) & MRCC_MRCC_GLB_CC2_GPIO0_MASK)

#define MRCC_MRCC_GLB_CC2_GPIO1_MASK             (0x20U)
#define MRCC_MRCC_GLB_CC2_GPIO1_SHIFT            (5U)
/*! GPIO1 - GPIO1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_GPIO1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_GPIO1_SHIFT)) & MRCC_MRCC_GLB_CC2_GPIO1_MASK)

#define MRCC_MRCC_GLB_CC2_GPIO2_MASK             (0x40U)
#define MRCC_MRCC_GLB_CC2_GPIO2_SHIFT            (6U)
/*! GPIO2 - GPIO2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_GPIO2(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_GPIO2_SHIFT)) & MRCC_MRCC_GLB_CC2_GPIO2_MASK)

#define MRCC_MRCC_GLB_CC2_GPIO3_MASK             (0x80U)
#define MRCC_MRCC_GLB_CC2_GPIO3_SHIFT            (7U)
/*! GPIO3 - GPIO3
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_GPIO3(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_GPIO3_SHIFT)) & MRCC_MRCC_GLB_CC2_GPIO3_MASK)

#define MRCC_MRCC_GLB_CC2_GPIO4_MASK             (0x100U)
#define MRCC_MRCC_GLB_CC2_GPIO4_SHIFT            (8U)
/*! GPIO4 - GPIO4
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_GPIO4(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_GPIO4_SHIFT)) & MRCC_MRCC_GLB_CC2_GPIO4_MASK)

#define MRCC_MRCC_GLB_CC2_MAU0_MASK              (0x200U)
#define MRCC_MRCC_GLB_CC2_MAU0_SHIFT             (9U)
/*! MAU0 - MAU0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_MAU0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_MAU0_SHIFT)) & MRCC_MRCC_GLB_CC2_MAU0_MASK)

