zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define MRCC_MRCC_GLB_ACC1_FLEXCAN0_MASK         (0x40000U)
#define MRCC_MRCC_GLB_ACC1_FLEXCAN0_SHIFT        (18U)
/*! FLEXCAN0 - FLEXCAN0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_FLEXCAN0(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_FLEXCAN0_SHIFT)) & MRCC_MRCC_GLB_ACC1_FLEXCAN0_MASK)

#define MRCC_MRCC_GLB_ACC1_FLEXCAN1_MASK         (0x80000U)
#define MRCC_MRCC_GLB_ACC1_FLEXCAN1_SHIFT        (19U)
/*! FLEXCAN1 - FLEXCAN1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_FLEXCAN1(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_FLEXCAN1_SHIFT)) & MRCC_MRCC_GLB_ACC1_FLEXCAN1_MASK)

#define MRCC_MRCC_GLB_ACC1_LPI2C2_MASK           (0x100000U)
#define MRCC_MRCC_GLB_ACC1_LPI2C2_SHIFT          (20U)
/*! LPI2C2 - LPI2C2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPI2C2(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPI2C2_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPI2C2_MASK)

#define MRCC_MRCC_GLB_ACC1_LPI2C3_MASK           (0x200000U)
#define MRCC_MRCC_GLB_ACC1_LPI2C3_SHIFT          (21U)
/*! LPI2C3 - LPI2C3
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPI2C3(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPI2C3_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPI2C3_MASK)

#define MRCC_MRCC_GLB_ACC1_LPUART5_MASK          (0x400000U)
#define MRCC_MRCC_GLB_ACC1_LPUART5_SHIFT         (22U)
/*! LPUART5 - LPUART5
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPUART5(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPUART5_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPUART5_MASK)

#define MRCC_MRCC_GLB_ACC1_PKC0_MASK             (0x1000000U)
#define MRCC_MRCC_GLB_ACC1_PKC0_SHIFT            (24U)
/*! PKC0 - PKC0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_PKC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_PKC0_SHIFT)) & MRCC_MRCC_GLB_ACC1_PKC0_MASK)

#define MRCC_MRCC_GLB_ACC1_SGI0_MASK             (0x2000000U)
#define MRCC_MRCC_GLB_ACC1_SGI0_SHIFT            (25U)
/*! SGI0 - SGI0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_SGI0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_SGI0_SHIFT)) & MRCC_MRCC_GLB_ACC1_SGI0_MASK)

#define MRCC_MRCC_GLB_ACC1_TRNG0_MASK            (0x4000000U)
#define MRCC_MRCC_GLB_ACC1_TRNG0_SHIFT           (26U)
/*! TRNG0 - TRNG0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_TRNG0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_TRNG0_SHIFT)) & MRCC_MRCC_GLB_ACC1_TRNG0_MASK)

#define MRCC_MRCC_GLB_ACC1_UDF0_MASK             (0x8000000U)
#define MRCC_MRCC_GLB_ACC1_UDF0_SHIFT            (27U)
/*! UDF0 - UDF0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_UDF0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_UDF0_SHIFT)) & MRCC_MRCC_GLB_ACC1_UDF0_MASK)

#define MRCC_MRCC_GLB_ACC1_ADC2_MASK             (0x10000000U)
#define MRCC_MRCC_GLB_ACC1_ADC2_SHIFT            (28U)
/*! ADC2 - ADC2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_ADC2(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_ADC2_SHIFT)) & MRCC_MRCC_GLB_ACC1_ADC2_MASK)

#define MRCC_MRCC_GLB_ACC1_ADC3_MASK             (0x20000000U)
#define MRCC_MRCC_GLB_ACC1_ADC3_SHIFT            (29U)
/*! ADC3 - ADC3
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_ADC3(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_ADC3_SHIFT)) & MRCC_MRCC_GLB_ACC1_ADC3_MASK)
/*! @} */

/*! @name MRCC_GLB_ACC2 - Control Automatic Clock Gating 2 */
/*! @{ */

#define MRCC_MRCC_GLB_ACC2_RAMA_MASK             (0x2U)
#define MRCC_MRCC_GLB_ACC2_RAMA_SHIFT            (1U)
/*! RAMA - RAMA
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_RAMA(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_RAMA_SHIFT)) & MRCC_MRCC_GLB_ACC2_RAMA_MASK)

#define MRCC_MRCC_GLB_ACC2_RAMB_MASK             (0x4U)
#define MRCC_MRCC_GLB_ACC2_RAMB_SHIFT            (2U)
/*! RAMB - RAMB
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_RAMB(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_RAMB_SHIFT)) & MRCC_MRCC_GLB_ACC2_RAMB_MASK)

#define MRCC_MRCC_GLB_ACC2_RAMC_MASK             (0x8U)
#define MRCC_MRCC_GLB_ACC2_RAMC_SHIFT            (3U)
/*! RAMC - RAMC
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_RAMC(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_RAMC_SHIFT)) & MRCC_MRCC_GLB_ACC2_RAMC_MASK)

#define MRCC_MRCC_GLB_ACC2_GPIO0_MASK            (0x10U)
#define MRCC_MRCC_GLB_ACC2_GPIO0_SHIFT           (4U)
/*! GPIO0 - GPIO0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_GPIO0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_GPIO0_SHIFT)) & MRCC_MRCC_GLB_ACC2_GPIO0_MASK)

#define MRCC_MRCC_GLB_ACC2_GPIO1_MASK            (0x20U)
#define MRCC_MRCC_GLB_ACC2_GPIO1_SHIFT           (5U)
/*! GPIO1 - GPIO1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_GPIO1(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_GPIO1_SHIFT)) & MRCC_MRCC_GLB_ACC2_GPIO1_MASK)

#define MRCC_MRCC_GLB_ACC2_GPIO2_MASK            (0x40U)
#define MRCC_MRCC_GLB_ACC2_GPIO2_SHIFT           (6U)
/*! GPIO2 - GPIO2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_GPIO2(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_GPIO2_SHIFT)) & MRCC_MRCC_GLB_ACC2_GPIO2_MASK)

