zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SGI_SGI_STATUS_SHA_ERROR_MASK            (0x8000U)
#define SGI_SGI_STATUS_SHA_ERROR_SHIFT           (15U)
/*! sha_error - SHA ERROR */
#define SGI_SGI_STATUS_SHA_ERROR(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_SHA_ERROR_SHIFT)) & SGI_SGI_STATUS_SHA_ERROR_MASK)

#define SGI_SGI_STATUS_KEY_READ_ERR_MASK         (0x10000U)
#define SGI_SGI_STATUS_KEY_READ_ERR_SHIFT        (16U)
/*! key_read_err - KEY SFR READ ERROR, sticky, cleared only with reset or flush */
#define SGI_SGI_STATUS_KEY_READ_ERR(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_KEY_READ_ERR_SHIFT)) & SGI_SGI_STATUS_KEY_READ_ERR_MASK)

#define SGI_SGI_STATUS_KEY_UNWRAP_ERR_MASK       (0x20000U)
#define SGI_SGI_STATUS_KEY_UNWRAP_ERR_SHIFT      (17U)
/*! key_unwrap_err - KEY UNWRAP ERROR , sticky, cleared only with reset or flush */
#define SGI_SGI_STATUS_KEY_UNWRAP_ERR(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_KEY_UNWRAP_ERR_SHIFT)) & SGI_SGI_STATUS_KEY_UNWRAP_ERR_MASK)

#define SGI_SGI_STATUS_STATUS_RSVD3_MASK         (0x40000U)
#define SGI_SGI_STATUS_STATUS_RSVD3_SHIFT        (18U)
/*! status_rsvd3 - reserved */
#define SGI_SGI_STATUS_STATUS_RSVD3(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_STATUS_RSVD3_SHIFT)) & SGI_SGI_STATUS_STATUS_RSVD3_MASK)

#define SGI_SGI_STATUS_STATUS_RSVD_MASK          (0xFFF80000U)
#define SGI_SGI_STATUS_STATUS_RSVD_SHIFT         (19U)
/*! status_rsvd - reserved */
#define SGI_SGI_STATUS_STATUS_RSVD(x)            (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_STATUS_RSVD_SHIFT)) & SGI_SGI_STATUS_STATUS_RSVD_MASK)
/*! @} */

/*! @name SGI_COUNT - Calculation counter */
/*! @{ */

#define SGI_SGI_COUNT_COUNT_MASK                 (0xFFFFU)
#define SGI_SGI_COUNT_COUNT_SHIFT                (0U)
/*! count - Calculation counter, incremented with */
#define SGI_SGI_COUNT_COUNT(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_COUNT_COUNT_SHIFT)) & SGI_SGI_COUNT_COUNT_MASK)

#define SGI_SGI_COUNT_COUNT_RSVD_MASK            (0xFFFF0000U)
#define SGI_SGI_COUNT_COUNT_RSVD_SHIFT           (16U)
/*! count_rsvd - reserved */
#define SGI_SGI_COUNT_COUNT_RSVD(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_COUNT_COUNT_RSVD_SHIFT)) & SGI_SGI_COUNT_COUNT_RSVD_MASK)
/*! @} */

/*! @name SGI_KEYCHK - Key checksum register */
/*! @{ */

#define SGI_SGI_KEYCHK_KEYCHKSUM_MASK            (0xFFFFFFFFU)
#define SGI_SGI_KEYCHK_KEYCHKSUM_SHIFT           (0U)
/*! keychksum - Key checksum (32-bit). */
#define SGI_SGI_KEYCHK_KEYCHKSUM(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEYCHK_KEYCHKSUM_SHIFT)) & SGI_SGI_KEYCHK_KEYCHKSUM_MASK)
/*! @} */

/*! @name SGI_CTRL - SGI Control register */
/*! @{ */

#define SGI_SGI_CTRL_START_MASK                  (0x1U)
#define SGI_SGI_CTRL_START_SHIFT                 (0U)
/*! start - Start crypto operation */
#define SGI_SGI_CTRL_START(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_START_SHIFT)) & SGI_SGI_CTRL_START_MASK)

#define SGI_SGI_CTRL_DECRYPT_MASK                (0x2U)
#define SGI_SGI_CTRL_DECRYPT_SHIFT               (1U)
/*! decrypt - Sets Cipher direction(AES and DES) */
#define SGI_SGI_CTRL_DECRYPT(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_DECRYPT_SHIFT)) & SGI_SGI_CTRL_DECRYPT_MASK)

#define SGI_SGI_CTRL_AESKEYSZ_MASK               (0xCU)
#define SGI_SGI_CTRL_AESKEYSZ_SHIFT              (2U)
/*! aeskeysz - Sets AES key size */
#define SGI_SGI_CTRL_AESKEYSZ(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AESKEYSZ_SHIFT)) & SGI_SGI_CTRL_AESKEYSZ_MASK)

#define SGI_SGI_CTRL_CRYPTO_OP_MASK              (0x70U)
#define SGI_SGI_CTRL_CRYPTO_OP_SHIFT             (4U)
/*! crypto_op - Sets 'Crypto Operation' type */
#define SGI_SGI_CTRL_CRYPTO_OP(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_CRYPTO_OP_SHIFT)) & SGI_SGI_CTRL_CRYPTO_OP_MASK)

#define SGI_SGI_CTRL_INSEL_MASK                  (0x780U)
#define SGI_SGI_CTRL_INSEL_SHIFT                 (7U)
/*! insel - 4'b0000 - DATIN[0] */
#define SGI_SGI_CTRL_INSEL(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_INSEL_SHIFT)) & SGI_SGI_CTRL_INSEL_MASK)

#define SGI_SGI_CTRL_OUTSEL_MASK                 (0x3800U)
#define SGI_SGI_CTRL_OUTSEL_SHIFT                (11U)
/*! outsel - 3'b000 - DATOUT = 'Kernel Res' */
#define SGI_SGI_CTRL_OUTSEL(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_OUTSEL_SHIFT)) & SGI_SGI_CTRL_OUTSEL_MASK)

#define SGI_SGI_CTRL_DATOUT_RES_MASK             (0xC000U)
#define SGI_SGI_CTRL_DATOUT_RES_SHIFT            (14U)
/*! datout_res - Kernels data out options */
#define SGI_SGI_CTRL_DATOUT_RES(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_DATOUT_RES_SHIFT)) & SGI_SGI_CTRL_DATOUT_RES_MASK)

#define SGI_SGI_CTRL_AES_EN_MASK                 (0x10000U)
#define SGI_SGI_CTRL_AES_EN_SHIFT                (16U)
/*! aes_en - AES Kernel Enable */
#define SGI_SGI_CTRL_AES_EN(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AES_EN_SHIFT)) & SGI_SGI_CTRL_AES_EN_MASK)

#define SGI_SGI_CTRL_DES_EN_MASK                 (0x20000U)
#define SGI_SGI_CTRL_DES_EN_SHIFT                (17U)
/*! des_en - DES Kernel Enable */
#define SGI_SGI_CTRL_DES_EN(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_DES_EN_SHIFT)) & SGI_SGI_CTRL_DES_EN_MASK)

#define SGI_SGI_CTRL_GCM_EN_MASK                 (0x40000U)
#define SGI_SGI_CTRL_GCM_EN_SHIFT                (18U)
/*! gcm_en - GFMUL Kernel Enable */
#define SGI_SGI_CTRL_GCM_EN(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_GCM_EN_SHIFT)) & SGI_SGI_CTRL_GCM_EN_MASK)

#define SGI_SGI_CTRL_PRNG_EN_MASK                (0x80000U)
#define SGI_SGI_CTRL_PRNG_EN_SHIFT               (19U)
/*! prng_en - PRNG Enable(only if SGI has internal PRNG, Please */
#define SGI_SGI_CTRL_PRNG_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_PRNG_EN_SHIFT)) & SGI_SGI_CTRL_PRNG_EN_MASK)

#define SGI_SGI_CTRL_INKEYSEL_MASK               (0x1F00000U)
#define SGI_SGI_CTRL_INKEYSEL_SHIFT              (20U)
/*! inkeysel - Input key selection */
#define SGI_SGI_CTRL_INKEYSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_INKEYSEL_SHIFT)) & SGI_SGI_CTRL_INKEYSEL_MASK)

