zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SGI_SGI_CTRL_TDESKEY_MASK                (0x2000000U)
#define SGI_SGI_CTRL_TDESKEY_SHIFT               (25U)
/*! tdeskey - Triple-DES Key Configuration */
#define SGI_SGI_CTRL_TDESKEY(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_TDESKEY_SHIFT)) & SGI_SGI_CTRL_TDESKEY_MASK)

#define SGI_SGI_CTRL_AES_NO_KL_MASK              (0x4000000U)
#define SGI_SGI_CTRL_AES_NO_KL_SHIFT             (26U)
/*! aes_no_kl - AES No decryption key schedule */
#define SGI_SGI_CTRL_AES_NO_KL(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AES_NO_KL_SHIFT)) & SGI_SGI_CTRL_AES_NO_KL_MASK)

#define SGI_SGI_CTRL_AES_SEL_MASK                (0x8000000U)
#define SGI_SGI_CTRL_AES_SEL_SHIFT               (27U)
/*! aes_sel - AES Dual Selection */
#define SGI_SGI_CTRL_AES_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AES_SEL_SHIFT)) & SGI_SGI_CTRL_AES_SEL_MASK)

#define SGI_SGI_CTRL_CTRL_RSVD_MASK              (0xF0000000U)
#define SGI_SGI_CTRL_CTRL_RSVD_SHIFT             (28U)
/*! ctrl_rsvd - reserved */
#define SGI_SGI_CTRL_CTRL_RSVD(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_CTRL_RSVD_SHIFT)) & SGI_SGI_CTRL_CTRL_RSVD_MASK)
/*! @} */

/*! @name SGI_CTRL2 - SGI Control register 2 */
/*! @{ */

#define SGI_SGI_CTRL2_FLUSH_MASK                 (0x1U)
#define SGI_SGI_CTRL2_FLUSH_SHIFT                (0U)
/*! flush - Start Full SGI Flush */
#define SGI_SGI_CTRL2_FLUSH(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_FLUSH_SHIFT)) & SGI_SGI_CTRL2_FLUSH_MASK)

#define SGI_SGI_CTRL2_KEY_FLUSH_MASK             (0x2U)
#define SGI_SGI_CTRL2_KEY_FLUSH_SHIFT            (1U)
/*! key_flush - Start KEY register-bank Flush */
#define SGI_SGI_CTRL2_KEY_FLUSH(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_KEY_FLUSH_SHIFT)) & SGI_SGI_CTRL2_KEY_FLUSH_MASK)

#define SGI_SGI_CTRL2_DATIN_FLUSH_MASK           (0x4U)
#define SGI_SGI_CTRL2_DATIN_FLUSH_SHIFT          (2U)
/*! datin_flush - Start DATIN register-bank Flush */
#define SGI_SGI_CTRL2_DATIN_FLUSH(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_DATIN_FLUSH_SHIFT)) & SGI_SGI_CTRL2_DATIN_FLUSH_MASK)

#define SGI_SGI_CTRL2_INCR_MASK                  (0x8U)
#define SGI_SGI_CTRL2_INCR_SHIFT                 (3U)
/*! incr - Increment(Triggered by SFR write) */
#define SGI_SGI_CTRL2_INCR(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_INCR_SHIFT)) & SGI_SGI_CTRL2_INCR_MASK)

#define SGI_SGI_CTRL2_XORWR_MASK                 (0x10U)
#define SGI_SGI_CTRL2_XORWR_SHIFT                (4U)
/*! xorwr - Write-XOR control */
#define SGI_SGI_CTRL2_XORWR(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_XORWR_SHIFT)) & SGI_SGI_CTRL2_XORWR_MASK)

#define SGI_SGI_CTRL2_FLUSHWR_MASK               (0x20U)
#define SGI_SGI_CTRL2_FLUSHWR_SHIFT              (5U)
/*! flushwr - Flush Write control */
#define SGI_SGI_CTRL2_FLUSHWR(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_FLUSHWR_SHIFT)) & SGI_SGI_CTRL2_FLUSHWR_MASK)

#define SGI_SGI_CTRL2_INCR_CIN_MASK              (0x40U)
#define SGI_SGI_CTRL2_INCR_CIN_SHIFT             (6U)
/*! incr_cin - Increment Carry-In control */
#define SGI_SGI_CTRL2_INCR_CIN(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_INCR_CIN_SHIFT)) & SGI_SGI_CTRL2_INCR_CIN_MASK)

#define SGI_SGI_CTRL2_CTRL2_RSVD3_MASK           (0x80U)
#define SGI_SGI_CTRL2_CTRL2_RSVD3_SHIFT          (7U)
/*! ctrl2_rsvd3 - reserved */
#define SGI_SGI_CTRL2_CTRL2_RSVD3(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_CTRL2_RSVD3_SHIFT)) & SGI_SGI_CTRL2_CTRL2_RSVD3_MASK)

#define SGI_SGI_CTRL2_SMASKEN_MASK               (0x100U)
#define SGI_SGI_CTRL2_SMASKEN_SHIFT              (8U)
/*! smasken - SFRMASK Enable */
#define SGI_SGI_CTRL2_SMASKEN(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_SMASKEN_SHIFT)) & SGI_SGI_CTRL2_SMASKEN_MASK)

#define SGI_SGI_CTRL2_SMASKSTEP_MASK             (0x200U)
#define SGI_SGI_CTRL2_SMASKSTEP_SHIFT            (9U)
/*! smaskstep - SFRSEED increment control */
#define SGI_SGI_CTRL2_SMASKSTEP(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_SMASKSTEP_SHIFT)) & SGI_SGI_CTRL2_SMASKSTEP_MASK)

#define SGI_SGI_CTRL2_SMASKSW_MASK               (0x400U)
#define SGI_SGI_CTRL2_SMASKSW_SHIFT              (10U)
/*! smasksw - SFRMASK MASK control */
#define SGI_SGI_CTRL2_SMASKSW(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_SMASKSW_SHIFT)) & SGI_SGI_CTRL2_SMASKSW_MASK)

#define SGI_SGI_CTRL2_CTRL2_RSVD2_MASK           (0x800U)
#define SGI_SGI_CTRL2_CTRL2_RSVD2_SHIFT          (11U)
/*! ctrl2_rsvd2 - reserved */
#define SGI_SGI_CTRL2_CTRL2_RSVD2(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_CTRL2_RSVD2_SHIFT)) & SGI_SGI_CTRL2_CTRL2_RSVD2_MASK)

#define SGI_SGI_CTRL2_MOVEM_MASK                 (0xF000U)
#define SGI_SGI_CTRL2_MOVEM_SHIFT                (12U)
/*! movem - 4-bit optional input for MOVEM feature */
#define SGI_SGI_CTRL2_MOVEM(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_MOVEM_SHIFT)) & SGI_SGI_CTRL2_MOVEM_MASK)

#define SGI_SGI_CTRL2_KEYRES_MASK                (0x1F0000U)
#define SGI_SGI_CTRL2_KEYRES_SHIFT               (16U)
/*! keyres - Selects key registers to be updated when rkey=1 */
#define SGI_SGI_CTRL2_KEYRES(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_KEYRES_SHIFT)) & SGI_SGI_CTRL2_KEYRES_MASK)

#define SGI_SGI_CTRL2_RKEY_MASK                  (0x200000U)
#define SGI_SGI_CTRL2_RKEY_SHIFT                 (21U)
/*! rkey - Crypto result location */
#define SGI_SGI_CTRL2_RKEY(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_RKEY_SHIFT)) & SGI_SGI_CTRL2_RKEY_MASK)

#define SGI_SGI_CTRL2_BYTES_ORDER_MASK           (0x400000U)
#define SGI_SGI_CTRL2_BYTES_ORDER_SHIFT          (22U)
/*! bytes_order - Byte order of regbank read/write data */
#define SGI_SGI_CTRL2_BYTES_ORDER(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_BYTES_ORDER_SHIFT)) & SGI_SGI_CTRL2_BYTES_ORDER_MASK)

#define SGI_SGI_CTRL2_GCM_INXOR_MASK             (0x800000U)
#define SGI_SGI_CTRL2_GCM_INXOR_SHIFT            (23U)
/*! gcm_inxor - GCM INXOR */
#define SGI_SGI_CTRL2_GCM_INXOR(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_GCM_INXOR_SHIFT)) & SGI_SGI_CTRL2_GCM_INXOR_MASK)

#define SGI_SGI_CTRL2_CTRL2_RSVD1_MASK           (0xFF000000U)
#define SGI_SGI_CTRL2_CTRL2_RSVD1_SHIFT          (24U)
/*! ctrl2_rsvd1 - reserved */
#define SGI_SGI_CTRL2_CTRL2_RSVD1(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_CTRL2_RSVD1_SHIFT)) & SGI_SGI_CTRL2_CTRL2_RSVD1_MASK)
/*! @} */

/*! @name SGI_DUMMY_CTRL - Configuration of dummy controls */
/*! @{ */

