zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SGI_SGI_DUMMY_CTRL_DDCTRL_MASK           (0x3FFU)
#define SGI_SGI_DUMMY_CTRL_DDCTRL_SHIFT          (0U)
/*! ddctrl - DES dummy control */
#define SGI_SGI_DUMMY_CTRL_DDCTRL(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DUMMY_CTRL_DDCTRL_SHIFT)) & SGI_SGI_DUMMY_CTRL_DDCTRL_MASK)

#define SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD2_MASK     (0xFC00U)
#define SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD2_SHIFT    (10U)
/*! dmyctl_rsvd2 - reserved */
#define SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD2(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD2_SHIFT)) & SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD2_MASK)

#define SGI_SGI_DUMMY_CTRL_ADCTRL_MASK           (0x3FF0000U)
#define SGI_SGI_DUMMY_CTRL_ADCTRL_SHIFT          (16U)
/*! adctrl - AES dummy control */
#define SGI_SGI_DUMMY_CTRL_ADCTRL(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DUMMY_CTRL_ADCTRL_SHIFT)) & SGI_SGI_DUMMY_CTRL_ADCTRL_MASK)

#define SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD1_MASK     (0xFC000000U)
#define SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD1_SHIFT    (26U)
/*! dmyctl_rsvd1 - reserved */
#define SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD1(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD1_SHIFT)) & SGI_SGI_DUMMY_CTRL_DMYCTL_RSVD1_MASK)
/*! @} */

/*! @name SGI_SFR_SW_MASK - Sofware Assisted Masking register . */
/*! @{ */

#define SGI_SGI_SFR_SW_MASK_SFR_MASK_VAL_MASK    (0xFFFFFFFFU)
#define SGI_SGI_SFR_SW_MASK_SFR_MASK_VAL_SHIFT   (0U)
/*! sfr_mask_val - Seed/mask used for sw level masking */
#define SGI_SGI_SFR_SW_MASK_SFR_MASK_VAL(x)      (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SFR_SW_MASK_SFR_MASK_VAL_SHIFT)) & SGI_SGI_SFR_SW_MASK_SFR_MASK_VAL_MASK)
/*! @} */

/*! @name SGI_SFRSEED - SFRSEED register for SFRMASK feature. */
/*! @{ */

#define SGI_SGI_SFRSEED_SFRSEED_MASK             (0xFFFFFFFFU)
#define SGI_SGI_SFRSEED_SFRSEED_SHIFT            (0U)
/*! sfrseed - Seed/mask used for sw level masking */
#define SGI_SGI_SFRSEED_SFRSEED(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SFRSEED_SFRSEED_SHIFT)) & SGI_SGI_SFRSEED_SFRSEED_MASK)
/*! @} */

/*! @name SGI_SHA2_CTRL - SHA Control Register */
/*! @{ */

#define SGI_SGI_SHA2_CTRL_SHA2_EN_MASK           (0x1U)
#define SGI_SGI_SHA2_CTRL_SHA2_EN_SHIFT          (0U)
/*! sha2_en - SHA enable */
#define SGI_SGI_SHA2_CTRL_SHA2_EN(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_EN_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_EN_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_MODE_MASK         (0x2U)
#define SGI_SGI_SHA2_CTRL_SHA2_MODE_SHIFT        (1U)
/*! sha2_mode - SHA mode normal or automatic */
#define SGI_SGI_SHA2_CTRL_SHA2_MODE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_MODE_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_MODE_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_SIZE_MASK         (0xCU)
#define SGI_SGI_SHA2_CTRL_SHA2_SIZE_SHIFT        (2U)
/*! sha2_size - SHA size 0=224;1=256;2=384;3=512 */
#define SGI_SGI_SHA2_CTRL_SHA2_SIZE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_SIZE_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_SIZE_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_MASK      (0xF0U)
#define SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_SHIFT     (4U)
/*! sha2_low_lim - SHA FIFO low limit */
#define SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_MASK     (0xF00U)
#define SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_SHIFT    (8U)
/*! sha2_high_lim - SHA FIFO high limit */
#define SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_MASK     (0x1000U)
#define SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_SHIFT    (12U)
/*! sha2_count_en - SHA Calculation counter enable */
#define SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_MASK)

#define SGI_SGI_SHA2_CTRL_HASH_RELOAD_MASK       (0x2000U)
#define SGI_SGI_SHA2_CTRL_HASH_RELOAD_SHIFT      (13U)
/*! hash_reload - SHA HASH reload */
#define SGI_SGI_SHA2_CTRL_HASH_RELOAD(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_HASH_RELOAD_SHIFT)) & SGI_SGI_SHA2_CTRL_HASH_RELOAD_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_STOP_MASK         (0x4000U)
#define SGI_SGI_SHA2_CTRL_SHA2_STOP_SHIFT        (14U)
/*! sha2_stop - STOP SHA AUTO mode */
#define SGI_SGI_SHA2_CTRL_SHA2_STOP(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_STOP_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_STOP_MASK)

#define SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_MASK      (0x8000U)
#define SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_SHIFT     (15U)
/*! no_auto_init - SHA no automatic HASH initialisation */
#define SGI_SGI_SHA2_CTRL_NO_AUTO_INIT(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_SHIFT)) & SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2CTL_RSVD_MASK      (0xFFFF0000U)
#define SGI_SGI_SHA2_CTRL_SHA2CTL_RSVD_SHIFT     (16U)
/*! sha2ctl_rsvd - reserved */
#define SGI_SGI_SHA2_CTRL_SHA2CTL_RSVD(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2CTL_RSVD_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2CTL_RSVD_MASK)
/*! @} */

/*! @name SGI_SHA_FIFO - SHA FIFO lower-bank low */
/*! @{ */

#define SGI_SGI_SHA_FIFO_FIFO_MASK               (0xFFFFFFFFU)
#define SGI_SGI_SHA_FIFO_FIFO_SHIFT              (0U)
/*! fifo - SHA FIFO register */
#define SGI_SGI_SHA_FIFO_FIFO(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA_FIFO_FIFO_SHIFT)) & SGI_SGI_SHA_FIFO_FIFO_MASK)
/*! @} */

/*! @name SGI_CONFIG - SHA Configuration Reg */
/*! @{ */

#define SGI_SGI_CONFIG_ROW_MASK                  (0x1U)
#define SGI_SGI_CONFIG_ROW_SHIFT                 (0U)
/*! row - SGI Diversified for 'ROW' */
#define SGI_SGI_CONFIG_ROW(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_ROW_SHIFT)) & SGI_SGI_CONFIG_ROW_MASK)

#define SGI_SGI_CONFIG_CHINA_MASK                (0x2U)
#define SGI_SGI_CONFIG_CHINA_SHIFT               (1U)
/*! china - SGI Diversified for 'CHINA' */
#define SGI_SGI_CONFIG_CHINA(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CHINA_SHIFT)) & SGI_SGI_CONFIG_CHINA_MASK)

#define SGI_SGI_CONFIG_CC_MASK                   (0x4U)
#define SGI_SGI_CONFIG_CC_SHIFT                  (2U)
/*! cc - SGI Diversified for 'CC' */
#define SGI_SGI_CONFIG_CC(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CC_SHIFT)) & SGI_SGI_CONFIG_CC_MASK)

