zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SGI_SGI_CONFIG_HAS_AES_MASK              (0x8U)
#define SGI_SGI_CONFIG_HAS_AES_SHIFT             (3U)
/*! has_aes - HAS AES */
#define SGI_SGI_CONFIG_HAS_AES(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_AES_SHIFT)) & SGI_SGI_CONFIG_HAS_AES_MASK)

#define SGI_SGI_CONFIG_HAS_DES_MASK              (0x10U)
#define SGI_SGI_CONFIG_HAS_DES_SHIFT             (4U)
/*! has_des - HAS DES */
#define SGI_SGI_CONFIG_HAS_DES(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_DES_SHIFT)) & SGI_SGI_CONFIG_HAS_DES_MASK)

#define SGI_SGI_CONFIG_HAS_SHA_MASK              (0x20U)
#define SGI_SGI_CONFIG_HAS_SHA_SHIFT             (5U)
/*! has_sha - HAS SHA */
#define SGI_SGI_CONFIG_HAS_SHA(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_SHA_SHIFT)) & SGI_SGI_CONFIG_HAS_SHA_MASK)

#define SGI_SGI_CONFIG_HAS_MOVEM_MASK            (0x40U)
#define SGI_SGI_CONFIG_HAS_MOVEM_SHIFT           (6U)
/*! has_movem - HAS MOVEM */
#define SGI_SGI_CONFIG_HAS_MOVEM(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_MOVEM_SHIFT)) & SGI_SGI_CONFIG_HAS_MOVEM_MASK)

#define SGI_SGI_CONFIG_HAS_CMAC_MASK             (0x80U)
#define SGI_SGI_CONFIG_HAS_CMAC_SHIFT            (7U)
/*! has_cmac - HAS CMAC */
#define SGI_SGI_CONFIG_HAS_CMAC(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_CMAC_SHIFT)) & SGI_SGI_CONFIG_HAS_CMAC_MASK)

#define SGI_SGI_CONFIG_HAS_GFMUL_MASK            (0x100U)
#define SGI_SGI_CONFIG_HAS_GFMUL_SHIFT           (8U)
/*! has_gfmul - HAS GFMUL */
#define SGI_SGI_CONFIG_HAS_GFMUL(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_GFMUL_SHIFT)) & SGI_SGI_CONFIG_HAS_GFMUL_MASK)

#define SGI_SGI_CONFIG_INTERNAL_PRNG_MASK        (0x200U)
#define SGI_SGI_CONFIG_INTERNAL_PRNG_SHIFT       (9U)
/*! internal_prng - HAS INTERNAL PRNG */
#define SGI_SGI_CONFIG_INTERNAL_PRNG(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_INTERNAL_PRNG_SHIFT)) & SGI_SGI_CONFIG_INTERNAL_PRNG_MASK)

#define SGI_SGI_CONFIG_KEY_DIGEST_MASK           (0x400U)
#define SGI_SGI_CONFIG_KEY_DIGEST_SHIFT          (10U)
/*! key_digest - HAS KEY DIGEST */
#define SGI_SGI_CONFIG_KEY_DIGEST(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_KEY_DIGEST_SHIFT)) & SGI_SGI_CONFIG_KEY_DIGEST_MASK)

#define SGI_SGI_CONFIG_COUNT_SIZE_MASK           (0x800U)
#define SGI_SGI_CONFIG_COUNT_SIZE_SHIFT          (11U)
/*! count_size - 0 - COUNT=16, 1 - COUNT=32 */
#define SGI_SGI_CONFIG_COUNT_SIZE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_COUNT_SIZE_SHIFT)) & SGI_SGI_CONFIG_COUNT_SIZE_MASK)

#define SGI_SGI_CONFIG_CONFIGC_RSVD_MASK         (0x1000U)
#define SGI_SGI_CONFIG_CONFIGC_RSVD_SHIFT        (12U)
/*! configc_rsvd - reserved */
#define SGI_SGI_CONFIG_CONFIGC_RSVD(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CONFIGC_RSVD_SHIFT)) & SGI_SGI_CONFIG_CONFIGC_RSVD_MASK)

#define SGI_SGI_CONFIG_FA_MASK                   (0x2000U)
#define SGI_SGI_CONFIG_FA_SHIFT                  (13U)
/*! fa - HAS FA protection */
#define SGI_SGI_CONFIG_FA(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_FA_SHIFT)) & SGI_SGI_CONFIG_FA_MASK)

#define SGI_SGI_CONFIG_CONFIGB2_RSVD_MASK        (0x4000U)
#define SGI_SGI_CONFIG_CONFIGB2_RSVD_SHIFT       (14U)
/*! configb2_rsvd - reserved */
#define SGI_SGI_CONFIG_CONFIGB2_RSVD(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CONFIGB2_RSVD_SHIFT)) & SGI_SGI_CONFIG_CONFIGB2_RSVD_MASK)

#define SGI_SGI_CONFIG_BUS_WIDTH_MASK            (0x8000U)
#define SGI_SGI_CONFIG_BUS_WIDTH_SHIFT           (15U)
/*! bus_width - 0 - BUS_WIDTH=16, 1 - BUS_WIDTH=32 */
#define SGI_SGI_CONFIG_BUS_WIDTH(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_BUS_WIDTH_SHIFT)) & SGI_SGI_CONFIG_BUS_WIDTH_MASK)

#define SGI_SGI_CONFIG_NUM_DATIN_MASK            (0x30000U)
#define SGI_SGI_CONFIG_NUM_DATIN_SHIFT           (16U)
/*! num_datin - NUMBER OF DATIN REGBANKS */
#define SGI_SGI_CONFIG_NUM_DATIN(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_NUM_DATIN_SHIFT)) & SGI_SGI_CONFIG_NUM_DATIN_MASK)

#define SGI_SGI_CONFIG_NUM_KEY_MASK              (0x1C0000U)
#define SGI_SGI_CONFIG_NUM_KEY_SHIFT             (18U)
/*! num_key - NUMBER OR KEY REGBANKS */
#define SGI_SGI_CONFIG_NUM_KEY(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_NUM_KEY_SHIFT)) & SGI_SGI_CONFIG_NUM_KEY_MASK)

#define SGI_SGI_CONFIG_EDC_MASK                  (0x200000U)
#define SGI_SGI_CONFIG_EDC_SHIFT                 (21U)
/*! edc - DATIN to KERNEL End-to-end EDC is enabled */
#define SGI_SGI_CONFIG_EDC(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_EDC_SHIFT)) & SGI_SGI_CONFIG_EDC_MASK)

#define SGI_SGI_CONFIG_CONFIGB_RSVD_MASK         (0xC00000U)
#define SGI_SGI_CONFIG_CONFIGB_RSVD_SHIFT        (22U)
/*! configb_rsvd - reserved */
#define SGI_SGI_CONFIG_CONFIGB_RSVD(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CONFIGB_RSVD_SHIFT)) & SGI_SGI_CONFIG_CONFIGB_RSVD_MASK)

#define SGI_SGI_CONFIG_SHA_256_ONLY_MASK         (0x1000000U)
#define SGI_SGI_CONFIG_SHA_256_ONLY_SHIFT        (24U)
/*! sha_256_only - HAS SHA-256 ONLY */
#define SGI_SGI_CONFIG_SHA_256_ONLY(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SHA_256_ONLY_SHIFT)) & SGI_SGI_CONFIG_SHA_256_ONLY_MASK)

#define SGI_SGI_CONFIG_SPB_SUPPORT_MASK          (0x2000000U)
#define SGI_SGI_CONFIG_SPB_SUPPORT_SHIFT         (25U)
/*! spb_support - ID_CFG_SGI_SPB_SUPPORT is set */
#define SGI_SGI_CONFIG_SPB_SUPPORT(x)            (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SPB_SUPPORT_SHIFT)) & SGI_SGI_CONFIG_SPB_SUPPORT_MASK)

#define SGI_SGI_CONFIG_SPB_MASKING_MASK          (0x4000000U)
#define SGI_SGI_CONFIG_SPB_MASKING_SHIFT         (26U)
/*! spb_masking - ID_CFG_SGI_SPB_MASKING is set */
#define SGI_SGI_CONFIG_SPB_MASKING(x)            (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SPB_MASKING_SHIFT)) & SGI_SGI_CONFIG_SPB_MASKING_MASK)

#define SGI_SGI_CONFIG_SFR_SW_MASK_MASK          (0x8000000U)
#define SGI_SGI_CONFIG_SFR_SW_MASK_SHIFT         (27U)
/*! sfr_sw_mask - ID_CFG_SGI_USE_SFR_SW_MASK is set */
#define SGI_SGI_CONFIG_SFR_SW_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SFR_SW_MASK_SHIFT)) & SGI_SGI_CONFIG_SFR_SW_MASK_MASK)

#define SGI_SGI_CONFIG_CONFIGA_RSVD_MASK         (0xF0000000U)
#define SGI_SGI_CONFIG_CONFIGA_RSVD_SHIFT        (28U)
/*! configa_rsvd - reserved */
#define SGI_SGI_CONFIG_CONFIGA_RSVD(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CONFIGA_RSVD_SHIFT)) & SGI_SGI_CONFIG_CONFIGA_RSVD_MASK)
/*! @} */

/*! @name SGI_CONFIG2 - SHA Configuration 2 Reg */
/*! @{ */

