zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SGI_SGI_CONFIG2_AES_USED_MASK            (0xFU)
#define SGI_SGI_CONFIG2_AES_USED_SHIFT           (0U)
/*! aes_used - 0=Apollo; 1=Aegis; 2=Ayna; 3=Athenium; 4=Ajax; */
#define SGI_SGI_CONFIG2_AES_USED(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_AES_USED_SHIFT)) & SGI_SGI_CONFIG2_AES_USED_MASK)

#define SGI_SGI_CONFIG2_AES_NUM_SBOXES_MASK      (0x1F0U)
#define SGI_SGI_CONFIG2_AES_NUM_SBOXES_SHIFT     (4U)
/*! aes_num_sboxes - Number of AES sboxes */
#define SGI_SGI_CONFIG2_AES_NUM_SBOXES(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_AES_NUM_SBOXES_SHIFT)) & SGI_SGI_CONFIG2_AES_NUM_SBOXES_MASK)

#define SGI_SGI_CONFIG2_AES_KEYSIZE_MASK         (0x600U)
#define SGI_SGI_CONFIG2_AES_KEYSIZE_SHIFT        (9U)
/*! aes_keysize - 0=128-Only,1=192-Only, 2=256-Only, 3=All Keysizes */
#define SGI_SGI_CONFIG2_AES_KEYSIZE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_AES_KEYSIZE_SHIFT)) & SGI_SGI_CONFIG2_AES_KEYSIZE_MASK)

#define SGI_SGI_CONFIG2_CONFIG2B_RSVD_MASK       (0xF800U)
#define SGI_SGI_CONFIG2_CONFIG2B_RSVD_SHIFT      (11U)
/*! config2b_rsvd - reserved */
#define SGI_SGI_CONFIG2_CONFIG2B_RSVD(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_CONFIG2B_RSVD_SHIFT)) & SGI_SGI_CONFIG2_CONFIG2B_RSVD_MASK)

#define SGI_SGI_CONFIG2_DES_USED_MASK            (0xF0000U)
#define SGI_SGI_CONFIG2_DES_USED_SHIFT           (16U)
/*! des_used - 0=Dakar; 1=Danube; 2=Depicta; 3=Digi; 4=Date; */
#define SGI_SGI_CONFIG2_DES_USED(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_DES_USED_SHIFT)) & SGI_SGI_CONFIG2_DES_USED_MASK)

#define SGI_SGI_CONFIG2_DES_NUM_SBOXES_MASK      (0x1F00000U)
#define SGI_SGI_CONFIG2_DES_NUM_SBOXES_SHIFT     (20U)
/*! des_num_sboxes - Number of DES sboxes */
#define SGI_SGI_CONFIG2_DES_NUM_SBOXES(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_DES_NUM_SBOXES_SHIFT)) & SGI_SGI_CONFIG2_DES_NUM_SBOXES_MASK)

#define SGI_SGI_CONFIG2_CONFIG2A_RSVD_MASK       (0xFE000000U)
#define SGI_SGI_CONFIG2_CONFIG2A_RSVD_SHIFT      (25U)
/*! config2a_rsvd - reserved */
#define SGI_SGI_CONFIG2_CONFIG2A_RSVD(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_CONFIG2A_RSVD_SHIFT)) & SGI_SGI_CONFIG2_CONFIG2A_RSVD_MASK)
/*! @} */

/*! @name SGI_AUTO_MODE - SGI Auto Mode Control register */
/*! @{ */

#define SGI_SGI_AUTO_MODE_AUTO_MODE_EN_MASK      (0x1U)
#define SGI_SGI_AUTO_MODE_AUTO_MODE_EN_SHIFT     (0U)
/*! auto_mode_en - auto_start_en */
#define SGI_SGI_AUTO_MODE_AUTO_MODE_EN(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_AUTO_MODE_EN_SHIFT)) & SGI_SGI_AUTO_MODE_AUTO_MODE_EN_MASK)

#define SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_MASK    (0x2U)
#define SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_SHIFT   (1U)
/*! auto_mode_stop - auto_mode_stop */
#define SGI_SGI_AUTO_MODE_AUTO_MODE_STOP(x)      (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_SHIFT)) & SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_MASK)

#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD1_MASK   (0xCU)
#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD1_SHIFT  (2U)
/*! auto_mode_rsvd1 - reserved */
#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD1(x)     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD1_SHIFT)) & SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD1_MASK)

#define SGI_SGI_AUTO_MODE_INCR_MODE_MASK         (0x30U)
#define SGI_SGI_AUTO_MODE_INCR_MODE_SHIFT        (4U)
/*! incr_mode - CTR increment mode */
#define SGI_SGI_AUTO_MODE_INCR_MODE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_INCR_MODE_SHIFT)) & SGI_SGI_AUTO_MODE_INCR_MODE_MASK)

#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD2_MASK   (0xC0U)
#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD2_SHIFT  (6U)
/*! auto_mode_rsvd2 - reserved */
#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD2(x)     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD2_SHIFT)) & SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD2_MASK)

#define SGI_SGI_AUTO_MODE_CMD_MASK               (0xFF00U)
#define SGI_SGI_AUTO_MODE_CMD_SHIFT              (8U)
/*! cmd - Auto mode of operation
 *  0b00000000..8'h00 - ECB mode
 *  0b00000001..8'h01 - CTR mode
 *  0b00000010..8'h02 - CBC mode
 *  0b00000011..8'h03 - CBCMAC mode
 *  0b00010000..8'h10 - Key Wrap/Unwrap(128 bit key data)
 *  0b00010001..8'h11 - Key Wrap/Unwrap(256 bit key data)
 */
#define SGI_SGI_AUTO_MODE_CMD(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_CMD_SHIFT)) & SGI_SGI_AUTO_MODE_CMD_MASK)

#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD3_MASK   (0xFFFF0000U)
#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD3_SHIFT  (16U)
/*! auto_mode_rsvd3 - reserved */
#define SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD3(x)     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD3_SHIFT)) & SGI_SGI_AUTO_MODE_AUTO_MODE_RSVD3_MASK)
/*! @} */

/*! @name SGI_AUTO_DMA_CTRL - SGI Auto Mode Control register */
/*! @{ */

#define SGI_SGI_AUTO_DMA_CTRL_IFE_MASK           (0x1U)
#define SGI_SGI_AUTO_DMA_CTRL_IFE_SHIFT          (0U)
/*! ife - Input FIFO DMA Enable */
#define SGI_SGI_AUTO_DMA_CTRL_IFE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_DMA_CTRL_IFE_SHIFT)) & SGI_SGI_AUTO_DMA_CTRL_IFE_MASK)

#define SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD1_MASK (0xFEU)
#define SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD1_SHIFT (1U)
/*! auto_dma_rsvd1 - reserved */
#define SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD1(x)  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD1_SHIFT)) & SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD1_MASK)

#define SGI_SGI_AUTO_DMA_CTRL_OFE_MASK           (0x100U)
#define SGI_SGI_AUTO_DMA_CTRL_OFE_SHIFT          (8U)
/*! ofe - Ouput FIFO DMA Enable */
#define SGI_SGI_AUTO_DMA_CTRL_OFE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_DMA_CTRL_OFE_SHIFT)) & SGI_SGI_AUTO_DMA_CTRL_OFE_MASK)

#define SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD2_MASK (0xFFFFFE00U)
#define SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD2_SHIFT (9U)
/*! auto_dma_rsvd2 - reserved */
#define SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD2(x)  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD2_SHIFT)) & SGI_SGI_AUTO_DMA_CTRL_AUTO_DMA_RSVD2_MASK)
/*! @} */

