zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
/*! @name SGI_PRNG_SW_SEED - SGI internal PRNG SW seeding register */
/*! @{ */

#define SGI_SGI_PRNG_SW_SEED_SEED_MASK           (0xFFFFFFFFU)
#define SGI_SGI_PRNG_SW_SEED_SEED_SHIFT          (0U)
/*! seed - 32-bits SEED field. A write to the SEED field */
#define SGI_SGI_PRNG_SW_SEED_SEED(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_PRNG_SW_SEED_SEED_SHIFT)) & SGI_SGI_PRNG_SW_SEED_SEED_MASK)
/*! @} */

/*! @name SGI_KEY_CTRL - SGI Key Control SFR */
/*! @{ */

#define SGI_SGI_KEY_CTRL_KEY_WO_MASK             (0xFFFFFFFFU)
#define SGI_SGI_KEY_CTRL_KEY_WO_SHIFT            (0U)
/*! key_wo - SGI Key control register(1-bit per KEY SFR) */
#define SGI_SGI_KEY_CTRL_KEY_WO(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY_CTRL_KEY_WO_SHIFT)) & SGI_SGI_KEY_CTRL_KEY_WO_MASK)
/*! @} */

/*! @name SGI_KEY_WRAP - Wrapped key read SFR */
/*! @{ */

#define SGI_SGI_KEY_WRAP_KW_DATA_MASK            (0xFFFFFFFFU)
#define SGI_SGI_KEY_WRAP_KW_DATA_SHIFT           (0U)
/*! kw_data - Field contains wrapped key, auto-updated by HW for each word */
#define SGI_SGI_KEY_WRAP_KW_DATA(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY_WRAP_KW_DATA_SHIFT)) & SGI_SGI_KEY_WRAP_KW_DATA_MASK)
/*! @} */

/*! @name SGI_VERSION - SGI Version */
/*! @{ */

#define SGI_SGI_VERSION_Z_MASK                   (0xFU)
#define SGI_SGI_VERSION_Z_SHIFT                  (0U)
/*! z - Extended revision number in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_Z(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_Z_SHIFT)) & SGI_SGI_VERSION_Z_MASK)

#define SGI_SGI_VERSION_Y2_MASK                  (0xF0U)
#define SGI_SGI_VERSION_Y2_SHIFT                 (4U)
/*! y2 - Minor revision number 2 in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_Y2(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_Y2_SHIFT)) & SGI_SGI_VERSION_Y2_MASK)

#define SGI_SGI_VERSION_Y1_MASK                  (0xF00U)
#define SGI_SGI_VERSION_Y1_SHIFT                 (8U)
/*! y1 - Minor revision number 1 in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_Y1(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_Y1_SHIFT)) & SGI_SGI_VERSION_Y1_MASK)

#define SGI_SGI_VERSION_X_MASK                   (0xF000U)
#define SGI_SGI_VERSION_X_SHIFT                  (12U)
/*! x - Major revision number in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_X(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_X_SHIFT)) & SGI_SGI_VERSION_X_MASK)

#define SGI_SGI_VERSION_MILESTONE_MASK           (0x30000U)
#define SGI_SGI_VERSION_MILESTONE_SHIFT          (16U)
/*! milestone - Release milestone. 00-PREL, 01-BR, 10-SI, 11-GO. */
#define SGI_SGI_VERSION_MILESTONE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_MILESTONE_SHIFT)) & SGI_SGI_VERSION_MILESTONE_MASK)

#define SGI_SGI_VERSION_VERSION_RSVD_1_MASK      (0xFFFC0000U)
#define SGI_SGI_VERSION_VERSION_RSVD_1_SHIFT     (18U)
/*! version_rsvd_1 - Reserved for Future Use */
#define SGI_SGI_VERSION_VERSION_RSVD_1(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_VERSION_RSVD_1_SHIFT)) & SGI_SGI_VERSION_VERSION_RSVD_1_MASK)
/*! @} */

/*! @name SGI_ACCESS_ERR - Access Error */
/*! @{ */

#define SGI_SGI_ACCESS_ERR_APB_NOTAV_MASK        (0x1U)
#define SGI_SGI_ACCESS_ERR_APB_NOTAV_SHIFT       (0U)
/*! apb_notav - APB Error: address not available */
#define SGI_SGI_ACCESS_ERR_APB_NOTAV(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_APB_NOTAV_SHIFT)) & SGI_SGI_ACCESS_ERR_APB_NOTAV_MASK)

#define SGI_SGI_ACCESS_ERR_APB_WRGMD_MASK        (0x2U)
#define SGI_SGI_ACCESS_ERR_APB_WRGMD_SHIFT       (1U)
/*! apb_wrgmd - APB Error: Wrong access mode */
#define SGI_SGI_ACCESS_ERR_APB_WRGMD(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_APB_WRGMD_SHIFT)) & SGI_SGI_ACCESS_ERR_APB_WRGMD_MASK)

#define SGI_SGI_ACCESS_ERR_ACCERR_RSVD1_MASK     (0xCU)
#define SGI_SGI_ACCESS_ERR_ACCERR_RSVD1_SHIFT    (2U)
/*! accerr_rsvd1 - reserved for future erors on SPB I/F */
#define SGI_SGI_ACCESS_ERR_ACCERR_RSVD1(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_ACCERR_RSVD1_SHIFT)) & SGI_SGI_ACCESS_ERR_ACCERR_RSVD1_MASK)

#define SGI_SGI_ACCESS_ERR_APB_MASTER_MASK       (0xF0U)
#define SGI_SGI_ACCESS_ERR_APB_MASTER_SHIFT      (4U)
/*! apb_master - APB Master that triggered first APB error */
#define SGI_SGI_ACCESS_ERR_APB_MASTER(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_APB_MASTER_SHIFT)) & SGI_SGI_ACCESS_ERR_APB_MASTER_MASK)

#define SGI_SGI_ACCESS_ERR_ACCERR_RSVD2_MASK     (0xFFFFFF00U)
#define SGI_SGI_ACCESS_ERR_ACCERR_RSVD2_SHIFT    (8U)
/*! accerr_rsvd2 - reserved for more block errors */
#define SGI_SGI_ACCESS_ERR_ACCERR_RSVD2(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_ACCERR_RSVD2_SHIFT)) & SGI_SGI_ACCESS_ERR_ACCERR_RSVD2_MASK)
/*! @} */

/*! @name SGI_ACCESS_ERR_CLR - Clear Access Error */
/*! @{ */

#define SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_MASK      (0x1U)
#define SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_SHIFT     (0U)
/*! err_clr - Write to reset SGI_ACCESS_ERR SFR. */
#define SGI_SGI_ACCESS_ERR_CLR_ERR_CLR(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_SHIFT)) & SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_MASK)

#define SGI_SGI_ACCESS_ERR_CLR_ACCERRC_RSVD_MASK (0xFFFFFFFEU)
#define SGI_SGI_ACCESS_ERR_CLR_ACCERRC_RSVD_SHIFT (1U)
/*! accerrc_rsvd - reserved */
#define SGI_SGI_ACCESS_ERR_CLR_ACCERRC_RSVD(x)   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_CLR_ACCERRC_RSVD_SHIFT)) & SGI_SGI_ACCESS_ERR_CLR_ACCERRC_RSVD_MASK)
/*! @} */

/*! @name SGI_INT_STATUS - Interrupt status */
/*! @{ */

#define SGI_SGI_INT_STATUS_INT_PDONE_MASK        (0x1U)
#define SGI_SGI_INT_STATUS_INT_PDONE_SHIFT       (0U)
/*! int_pdone - Interrupt status flag: */
#define SGI_SGI_INT_STATUS_INT_PDONE(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_INT_PDONE_SHIFT)) & SGI_SGI_INT_STATUS_INT_PDONE_MASK)

#define SGI_SGI_INT_STATUS_INTST_RSVD_MASK       (0xFFFFFFFEU)
#define SGI_SGI_INT_STATUS_INTST_RSVD_SHIFT      (1U)
/*! intst_rsvd - reserved */
#define SGI_SGI_INT_STATUS_INTST_RSVD(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_INTST_RSVD_SHIFT)) & SGI_SGI_INT_STATUS_INTST_RSVD_MASK)
/*! @} */

/*! @name SGI_INT_ENABLE - Interrupt enable */
/*! @{ */

#define SGI_SGI_INT_ENABLE_INT_EN_MASK           (0x1U)
#define SGI_SGI_INT_ENABLE_INT_EN_SHIFT          (0U)
/*! int_en - Interrupt enable bit */
#define SGI_SGI_INT_ENABLE_INT_EN(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_ENABLE_INT_EN_SHIFT)) & SGI_SGI_INT_ENABLE_INT_EN_MASK)

#define SGI_SGI_INT_ENABLE_INT_ENA_RSVD_MASK     (0xFFFFFFFEU)
#define SGI_SGI_INT_ENABLE_INT_ENA_RSVD_SHIFT    (1U)
/*! int_ena_rsvd - reserved */
#define SGI_SGI_INT_ENABLE_INT_ENA_RSVD(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_ENABLE_INT_ENA_RSVD_SHIFT)) & SGI_SGI_INT_ENABLE_INT_ENA_RSVD_MASK)
/*! @} */

/*! @name SGI_INT_STATUS_CLR - Interrupt status clear */
/*! @{ */

#define SGI_SGI_INT_STATUS_CLR_INT_CLR_MASK      (0x1U)
#define SGI_SGI_INT_STATUS_CLR_INT_CLR_SHIFT     (0U)
/*! int_clr - Write to clear interrupt status flag (SGI_INT_STATUS.INT_PDONE=0). */
#define SGI_SGI_INT_STATUS_CLR_INT_CLR(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_CLR_INT_CLR_SHIFT)) & SGI_SGI_INT_STATUS_CLR_INT_CLR_MASK)

#define SGI_SGI_INT_STATUS_CLR_INT_STSC_RSVD_MASK (0xFFFFFFFEU)
#define SGI_SGI_INT_STATUS_CLR_INT_STSC_RSVD_SHIFT (1U)
/*! int_stsc_rsvd - reserved */
#define SGI_SGI_INT_STATUS_CLR_INT_STSC_RSVD(x)  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_CLR_INT_STSC_RSVD_SHIFT)) & SGI_SGI_INT_STATUS_CLR_INT_STSC_RSVD_MASK)
/*! @} */

