zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
/*! @name SGI_INT_STATUS_SET - Interrupt status set */
/*! @{ */

#define SGI_SGI_INT_STATUS_SET_INT_SET_MASK      (0x1U)
#define SGI_SGI_INT_STATUS_SET_INT_SET_SHIFT     (0U)
/*! int_set - Write to set interrupt status flag (SGI_INT_STATUS.INT_PDONE=1) to trigger a SGI
 *    interrupt via software, e.g. for debug purposes.
 */
#define SGI_SGI_INT_STATUS_SET_INT_SET(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_SET_INT_SET_SHIFT)) & SGI_SGI_INT_STATUS_SET_INT_SET_MASK)

#define SGI_SGI_INT_STATUS_SET_INT_STSS_RSVD_MASK (0xFFFFFFFEU)
#define SGI_SGI_INT_STATUS_SET_INT_STSS_RSVD_SHIFT (1U)
/*! int_stss_rsvd - reserved */
#define SGI_SGI_INT_STATUS_SET_INT_STSS_RSVD(x)  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_SET_INT_STSS_RSVD_SHIFT)) & SGI_SGI_INT_STATUS_SET_INT_STSS_RSVD_MASK)
/*! @} */

/*! @name SGI_MODULE_ID - Module ID */
/*! @{ */

#define SGI_SGI_MODULE_ID_PLACEHOLDER_MASK       (0xFFFFFFFFU)
#define SGI_SGI_MODULE_ID_PLACEHOLDER_SHIFT      (0U)
/*! placeholder - Module ID */
#define SGI_SGI_MODULE_ID_PLACEHOLDER(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_MODULE_ID_PLACEHOLDER_SHIFT)) & SGI_SGI_MODULE_ID_PLACEHOLDER_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SGI_Register_Masks */


/* SGI - Peripheral instance base addresses */
/** Peripheral SGI0 base address */
#define SGI0_BASE                                (0x400EB000u)
/** Peripheral SGI0 base pointer */
#define SGI0                                     ((SGI_Type *)SGI0_BASE)
/** Array initializer of SGI peripheral base addresses */
#define SGI_BASE_ADDRS                           { SGI0_BASE }
/** Array initializer of SGI peripheral base pointers */
#define SGI_BASE_PTRS                            { SGI0 }

/*!
 * @}
 */ /* end of group SGI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SLCD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SLCD_Peripheral_Access_Layer SLCD Peripheral Access Layer
 * @{
 */

/** SLCD - Register Layout Typedef */
typedef struct {
  __IO uint32_t LCD_GCR;                           /**< LCD General Control Register, offset: 0x0 */
  __IO uint32_t LCD_AR;                            /**< LCD Auxiliary Register, offset: 0x4 */
  __IO uint32_t LCD_FDCR;                          /**< LCD Fault Detect Control Register, offset: 0x8 */
  __IO uint32_t LCD_FDSR;                          /**< LCD Fault Detect Status Register, offset: 0xC */
  __IO uint32_t LCD_PEN0;                          /**< LCD Pin Enable Register 0, offset: 0x10 */
  __IO uint32_t LCD_PEN1;                          /**< LCD Pin Enable Register 1, offset: 0x14 */
  __IO uint32_t LCD_BPEN0;                         /**< LCD Back Plane Enable Register 0, offset: 0x18 */
  __IO uint32_t LCD_BPEN1;                         /**< LCD Back Plane Enable Register 1, offset: 0x1C */
  __IO uint32_t LCD_WFTO[12];                      /**< LCD Waveform 3 to 0 Register..LCD Waveform 47 to 44 Register, array offset: 0x20, array step: 0x4 */
} SLCD_Type;

/* ----------------------------------------------------------------------------
   -- SLCD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SLCD_Register_Masks SLCD Register Masks
 * @{
 */

/*! @name LCD_GCR - LCD General Control Register */
/*! @{ */

#define SLCD_LCD_GCR_DUTY_MASK                   (0x3U)
#define SLCD_LCD_GCR_DUTY_SHIFT                  (0U)
/*! DUTY - LCD duty select
 *  0b00..Use 1 BP (1/1 duty cycle).
 *  0b01..Use 2 BP (1/2 duty cycle).
 *  0b10..Use 3 BP (1/3 duty cycle).
 *  0b11..Use 4 BP (1/4 duty cycle).(Default)
 */
#define SLCD_LCD_GCR_DUTY(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_DUTY_SHIFT)) & SLCD_LCD_GCR_DUTY_MASK)

#define SLCD_LCD_GCR_LCLK_MASK                   (0x38U)
#define SLCD_LCD_GCR_LCLK_SHIFT                  (3U)
/*! LCLK - LCD Clock Prescaler */
#define SLCD_LCD_GCR_LCLK(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCLK_SHIFT)) & SLCD_LCD_GCR_LCLK_MASK)

#define SLCD_LCD_GCR_LCDLP_MASK                  (0x40U)
#define SLCD_LCD_GCR_LCDLP_SHIFT                 (6U)
/*! LCDLP - LCD Low Power Waveform
 *  0b0..LCD driver drives standard waveforms.
 *  0b1..LCD driver drives low-power waveforms.
 */
#define SLCD_LCD_GCR_LCDLP(x)                    (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDLP_SHIFT)) & SLCD_LCD_GCR_LCDLP_MASK)

#define SLCD_LCD_GCR_LCDEN_MASK                  (0x80U)
#define SLCD_LCD_GCR_LCDEN_SHIFT                 (7U)
/*! LCDEN - LCD Driver Enable */
#define SLCD_LCD_GCR_LCDEN(x)                    (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDEN_SHIFT)) & SLCD_LCD_GCR_LCDEN_MASK)

#define SLCD_LCD_GCR_LCDSTP_MASK                 (0x100U)
#define SLCD_LCD_GCR_LCDSTP_SHIFT                (8U)
/*! LCDSTP - LCD Stop
 *  0b0..Allows the LCD driver to continue running during Stop mode.
 *  0b1..Disables the LCD driver when MCU enters Stop mode.
 */
#define SLCD_LCD_GCR_LCDSTP(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDSTP_SHIFT)) & SLCD_LCD_GCR_LCDSTP_MASK)

#define SLCD_LCD_GCR_LCDDOZE_MASK                (0x200U)
#define SLCD_LCD_GCR_LCDDOZE_SHIFT               (9U)
/*! LCDDOZE - LCD Doze enable
 *  0b0..Allows the LCD driver to continue running during Doze mode.
 *  0b1..Disables the LCD driver when MCU enters Doze mode.
 */
#define SLCD_LCD_GCR_LCDDOZE(x)                  (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDDOZE_SHIFT)) & SLCD_LCD_GCR_LCDDOZE_MASK)

#define SLCD_LCD_GCR_FDCIEN_MASK                 (0x4000U)
#define SLCD_LCD_GCR_FDCIEN_SHIFT                (14U)
/*! FDCIEN - LCD Fault Detection Complete Interrupt Enable
 *  0b0..No interrupt request is generated by this event.
 *  0b1..When a fault is detected and FDCF bit is set, this event causes an interrupt request.
 */
#define SLCD_LCD_GCR_FDCIEN(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_FDCIEN_SHIFT)) & SLCD_LCD_GCR_FDCIEN_MASK)

#define SLCD_LCD_GCR_LCDIEN_MASK                 (0x8000U)
#define SLCD_LCD_GCR_LCDIEN_SHIFT                (15U)
/*! LCDIEN - LCD Frame Frequency Interrupt Enable
 *  0b0..No interrupt request is generated by this event.
 *  0b1..When LCDIF bit is set, this event causes an interrupt request.
 */
#define SLCD_LCD_GCR_LCDIEN(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDIEN_SHIFT)) & SLCD_LCD_GCR_LCDIEN_MASK)

