zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SLCD_LCD_GCR_SHCYCLE_MASK                (0x10000U)
#define SLCD_LCD_GCR_SHCYCLE_SHIFT               (16U)
/*! SHCYCLE - Sample & Hold Cycle Select
 *  0b0..Sample & hold phase clock period is 64 LCD clock (16kHz) period / 32 LCD clock (8kHz) period.
 *  0b1..Sample & hold phase clock period is 128 LCD clk (16kHz) period / 64 LCD clock (8kHz) period.
 */
#define SLCD_LCD_GCR_SHCYCLE(x)                  (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_SHCYCLE_SHIFT)) & SLCD_LCD_GCR_SHCYCLE_MASK)

#define SLCD_LCD_GCR_SHEN_MASK                   (0x800000U)
#define SLCD_LCD_GCR_SHEN_SHIFT                  (23U)
/*! SHEN - Sample & Hold Mode Enable
 *  0b0..Sample & hold is disabled.
 *  0b1..Sample & hold is enabled.
 */
#define SLCD_LCD_GCR_SHEN(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_SHEN_SHIFT)) & SLCD_LCD_GCR_SHEN_MASK)

#define SLCD_LCD_GCR_VLL1TRIM_MASK               (0xF000000U)
#define SLCD_LCD_GCR_VLL1TRIM_SHIFT              (24U)
/*! VLL1TRIM - Level 1 Voltage Trim */
#define SLCD_LCD_GCR_VLL1TRIM(x)                 (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_VLL1TRIM_SHIFT)) & SLCD_LCD_GCR_VLL1TRIM_MASK)

#define SLCD_LCD_GCR_VLL2TRIM_MASK               (0xF0000000U)
#define SLCD_LCD_GCR_VLL2TRIM_SHIFT              (28U)
/*! VLL2TRIM - Level 2 Voltage Trim */
#define SLCD_LCD_GCR_VLL2TRIM(x)                 (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_VLL2TRIM_SHIFT)) & SLCD_LCD_GCR_VLL2TRIM_MASK)
/*! @} */

/*! @name LCD_AR - LCD Auxiliary Register */
/*! @{ */

#define SLCD_LCD_AR_BRATE_MASK                   (0x7U)
#define SLCD_LCD_AR_BRATE_SHIFT                  (0U)
/*! BRATE - Blink-rate configuration */
#define SLCD_LCD_AR_BRATE(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_AR_BRATE_SHIFT)) & SLCD_LCD_AR_BRATE_MASK)

#define SLCD_LCD_AR_BMODE_MASK                   (0x8U)
#define SLCD_LCD_AR_BMODE_SHIFT                  (3U)
/*! BMODE - Blink mode
 *  0b0..Display blank during the blink period.
 *  0b1..Display alternate display during blink period.
 */
#define SLCD_LCD_AR_BMODE(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_AR_BMODE_SHIFT)) & SLCD_LCD_AR_BMODE_MASK)

#define SLCD_LCD_AR_BLANK_MASK                   (0x20U)
#define SLCD_LCD_AR_BLANK_SHIFT                  (5U)
/*! BLANK - Blank display mode
 *  0b0..Normal or alternate display mode.
 *  0b1..Blank display mode.
 */
#define SLCD_LCD_AR_BLANK(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_AR_BLANK_SHIFT)) & SLCD_LCD_AR_BLANK_MASK)

#define SLCD_LCD_AR_ALT_MASK                     (0x40U)
#define SLCD_LCD_AR_ALT_SHIFT                    (6U)
/*! ALT - Alternate display mode
 *  0b0..Normal display mode.
 *  0b1..Alternate display mode.
 */
#define SLCD_LCD_AR_ALT(x)                       (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_AR_ALT_SHIFT)) & SLCD_LCD_AR_ALT_MASK)

#define SLCD_LCD_AR_BLINK_MASK                   (0x80U)
#define SLCD_LCD_AR_BLINK_SHIFT                  (7U)
/*! BLINK - Blink command
 *  0b0..Disables blinking.
 *  0b1..Starts blinking at blinking frequency specified by LCD blink rate calculation.
 */
#define SLCD_LCD_AR_BLINK(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_AR_BLINK_SHIFT)) & SLCD_LCD_AR_BLINK_MASK)

#define SLCD_LCD_AR_LCDIF_MASK                   (0x8000U)
#define SLCD_LCD_AR_LCDIF_SHIFT                  (15U)
/*! LCDIF - LCD Frame Frequency Interrupt flag
 *  0b0..Frame frequency interrupt condition has not occurred.
 *  0b1..Start of SLCD frame has occurred.
 */
#define SLCD_LCD_AR_LCDIF(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_AR_LCDIF_SHIFT)) & SLCD_LCD_AR_LCDIF_MASK)
/*! @} */

/*! @name LCD_FDCR - LCD Fault Detect Control Register */
/*! @{ */

#define SLCD_LCD_FDCR_FDPINID_MASK               (0x3FU)
#define SLCD_LCD_FDCR_FDPINID_SHIFT              (0U)
/*! FDPINID - Fault Detect Pin ID */
#define SLCD_LCD_FDCR_FDPINID(x)                 (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_FDCR_FDPINID_SHIFT)) & SLCD_LCD_FDCR_FDPINID_MASK)

#define SLCD_LCD_FDCR_FDBPEN_MASK                (0x40U)
#define SLCD_LCD_FDCR_FDBPEN_SHIFT               (6U)
/*! FDBPEN - Fault Detect Back Plane Enable
 *  0b0..Type of the selected pin under fault detect test is front plane.
 *  0b1..Type of the selected pin under fault detect test is back plane.
 */
#define SLCD_LCD_FDCR_FDBPEN(x)                  (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_FDCR_FDBPEN_SHIFT)) & SLCD_LCD_FDCR_FDBPEN_MASK)

#define SLCD_LCD_FDCR_FDEN_MASK                  (0x80U)
#define SLCD_LCD_FDCR_FDEN_SHIFT                 (7U)
/*! FDEN - Fault Detect Enable
 *  0b0..Disable fault detection.
 *  0b1..Enable fault detection.
 */
#define SLCD_LCD_FDCR_FDEN(x)                    (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_FDCR_FDEN_SHIFT)) & SLCD_LCD_FDCR_FDEN_MASK)

#define SLCD_LCD_FDCR_FDSWW_MASK                 (0xE00U)
#define SLCD_LCD_FDCR_FDSWW_SHIFT                (9U)
/*! FDSWW - Fault Detect Sample Window Width
 *  0b000..Sample window width is 4 sample clock cycles.
 *  0b001..Sample window width is 8 sample clock cycles.
 *  0b010..Sample window width is 16 sample clock cycles.
 *  0b011..Sample window width is 32 sample clock cycles.
 *  0b100..Sample window width is 64 sample clock cycles.
 *  0b101..Sample window width is 128 sample clock cycles.
 *  0b110..Sample window width is 256 sample clock cycles.
 *  0b111..Sample window width is 512 sample clock cycles.
 */
#define SLCD_LCD_FDCR_FDSWW(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_FDCR_FDSWW_SHIFT)) & SLCD_LCD_FDCR_FDSWW_MASK)

#define SLCD_LCD_FDCR_FDPRS_MASK                 (0x7000U)
#define SLCD_LCD_FDCR_FDPRS_SHIFT                (12U)
/*! FDPRS - Fault Detect Clock Prescaler
 *  0b000..1/1 bus clock.
 *  0b001..1/2 bus clock.
 *  0b010..1/4 bus clock.
 *  0b011..1/8 bus clock.
 *  0b100..1/16 bus clock.
 *  0b101..1/32 bus clock.
 *  0b110..1/64 bus clock.
 *  0b111..1/128 bus clock.
 */
#define SLCD_LCD_FDCR_FDPRS(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_FDCR_FDPRS_SHIFT)) & SLCD_LCD_FDCR_FDPRS_MASK)
/*! @} */

/*! @name LCD_FDSR - LCD Fault Detect Status Register */
/*! @{ */

