zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SLCD_LCD_FDSR_FDCNT_MASK                 (0xFFU)
#define SLCD_LCD_FDSR_FDCNT_SHIFT                (0U)
/*! FDCNT - Fault Detect Counter */
#define SLCD_LCD_FDSR_FDCNT(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_FDSR_FDCNT_SHIFT)) & SLCD_LCD_FDSR_FDCNT_MASK)

#define SLCD_LCD_FDSR_FDCF_MASK                  (0x8000U)
#define SLCD_LCD_FDSR_FDCF_SHIFT                 (15U)
/*! FDCF - Fault Detection Complete Flag
 *  0b0..Fault detection is not completed.
 *  0b1..Fault detection is completed.
 */
#define SLCD_LCD_FDSR_FDCF(x)                    (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_FDSR_FDCF_SHIFT)) & SLCD_LCD_FDSR_FDCF_MASK)
/*! @} */

/*! @name LCD_PEN0 - LCD Pin Enable Register 0 */
/*! @{ */

#define SLCD_LCD_PEN0_PIN_0_EN_MASK              (0x1U)
#define SLCD_LCD_PEN0_PIN_0_EN_SHIFT             (0U)
/*! PIN_0_EN - LCD Pin 0 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_0_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_0_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_0_EN_MASK)

#define SLCD_LCD_PEN0_PIN_1_EN_MASK              (0x2U)
#define SLCD_LCD_PEN0_PIN_1_EN_SHIFT             (1U)
/*! PIN_1_EN - LCD Pin 1 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_1_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_1_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_1_EN_MASK)

#define SLCD_LCD_PEN0_PIN_2_EN_MASK              (0x4U)
#define SLCD_LCD_PEN0_PIN_2_EN_SHIFT             (2U)
/*! PIN_2_EN - LCD Pin 2 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_2_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_2_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_2_EN_MASK)

#define SLCD_LCD_PEN0_PIN_3_EN_MASK              (0x8U)
#define SLCD_LCD_PEN0_PIN_3_EN_SHIFT             (3U)
/*! PIN_3_EN - LCD Pin 3 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_3_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_3_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_3_EN_MASK)

#define SLCD_LCD_PEN0_PIN_4_EN_MASK              (0x10U)
#define SLCD_LCD_PEN0_PIN_4_EN_SHIFT             (4U)
/*! PIN_4_EN - LCD Pin 4 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_4_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_4_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_4_EN_MASK)

#define SLCD_LCD_PEN0_PIN_5_EN_MASK              (0x20U)
#define SLCD_LCD_PEN0_PIN_5_EN_SHIFT             (5U)
/*! PIN_5_EN - LCD Pin 5 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_5_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_5_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_5_EN_MASK)

#define SLCD_LCD_PEN0_PIN_6_EN_MASK              (0x40U)
#define SLCD_LCD_PEN0_PIN_6_EN_SHIFT             (6U)
/*! PIN_6_EN - LCD Pin 6 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_6_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_6_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_6_EN_MASK)

#define SLCD_LCD_PEN0_PIN_7_EN_MASK              (0x80U)
#define SLCD_LCD_PEN0_PIN_7_EN_SHIFT             (7U)
/*! PIN_7_EN - LCD Pin 7 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_7_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_7_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_7_EN_MASK)

#define SLCD_LCD_PEN0_PIN_8_EN_MASK              (0x100U)
#define SLCD_LCD_PEN0_PIN_8_EN_SHIFT             (8U)
/*! PIN_8_EN - LCD Pin 8 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_8_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_8_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_8_EN_MASK)

#define SLCD_LCD_PEN0_PIN_9_EN_MASK              (0x200U)
#define SLCD_LCD_PEN0_PIN_9_EN_SHIFT             (9U)
/*! PIN_9_EN - LCD Pin 9 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_9_EN(x)                (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_9_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_9_EN_MASK)

#define SLCD_LCD_PEN0_PIN_10_EN_MASK             (0x400U)
#define SLCD_LCD_PEN0_PIN_10_EN_SHIFT            (10U)
/*! PIN_10_EN - LCD Pin 10 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_10_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_10_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_10_EN_MASK)

#define SLCD_LCD_PEN0_PIN_11_EN_MASK             (0x800U)
#define SLCD_LCD_PEN0_PIN_11_EN_SHIFT            (11U)
/*! PIN_11_EN - LCD Pin 11 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_11_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_11_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_11_EN_MASK)

#define SLCD_LCD_PEN0_PIN_12_EN_MASK             (0x1000U)
#define SLCD_LCD_PEN0_PIN_12_EN_SHIFT            (12U)
/*! PIN_12_EN - LCD Pin 12 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_12_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_12_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_12_EN_MASK)

#define SLCD_LCD_PEN0_PIN_13_EN_MASK             (0x2000U)
#define SLCD_LCD_PEN0_PIN_13_EN_SHIFT            (13U)
/*! PIN_13_EN - LCD Pin 13 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_13_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_13_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_13_EN_MASK)

#define SLCD_LCD_PEN0_PIN_14_EN_MASK             (0x4000U)
#define SLCD_LCD_PEN0_PIN_14_EN_SHIFT            (14U)
/*! PIN_14_EN - LCD Pin 14 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_14_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_14_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_14_EN_MASK)

#define SLCD_LCD_PEN0_PIN_15_EN_MASK             (0x8000U)
#define SLCD_LCD_PEN0_PIN_15_EN_SHIFT            (15U)
/*! PIN_15_EN - LCD Pin 15 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_15_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_15_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_15_EN_MASK)

#define SLCD_LCD_PEN0_PIN_16_EN_MASK             (0x10000U)
#define SLCD_LCD_PEN0_PIN_16_EN_SHIFT            (16U)
/*! PIN_16_EN - LCD Pin 16 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_16_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_16_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_16_EN_MASK)

