zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SLCD_LCD_PEN0_PIN_17_EN_MASK             (0x20000U)
#define SLCD_LCD_PEN0_PIN_17_EN_SHIFT            (17U)
/*! PIN_17_EN - LCD Pin 17 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_17_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_17_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_17_EN_MASK)

#define SLCD_LCD_PEN0_PIN_18_EN_MASK             (0x40000U)
#define SLCD_LCD_PEN0_PIN_18_EN_SHIFT            (18U)
/*! PIN_18_EN - LCD Pin 18 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_18_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_18_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_18_EN_MASK)

#define SLCD_LCD_PEN0_PIN_19_EN_MASK             (0x80000U)
#define SLCD_LCD_PEN0_PIN_19_EN_SHIFT            (19U)
/*! PIN_19_EN - LCD Pin 19 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_19_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_19_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_19_EN_MASK)

#define SLCD_LCD_PEN0_PIN_20_EN_MASK             (0x100000U)
#define SLCD_LCD_PEN0_PIN_20_EN_SHIFT            (20U)
/*! PIN_20_EN - LCD Pin 20 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_20_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_20_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_20_EN_MASK)

#define SLCD_LCD_PEN0_PIN_21_EN_MASK             (0x200000U)
#define SLCD_LCD_PEN0_PIN_21_EN_SHIFT            (21U)
/*! PIN_21_EN - LCD Pin 21 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_21_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_21_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_21_EN_MASK)

#define SLCD_LCD_PEN0_PIN_22_EN_MASK             (0x400000U)
#define SLCD_LCD_PEN0_PIN_22_EN_SHIFT            (22U)
/*! PIN_22_EN - LCD Pin 22 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_22_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_22_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_22_EN_MASK)

#define SLCD_LCD_PEN0_PIN_23_EN_MASK             (0x800000U)
#define SLCD_LCD_PEN0_PIN_23_EN_SHIFT            (23U)
/*! PIN_23_EN - LCD Pin 23 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_23_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_23_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_23_EN_MASK)

#define SLCD_LCD_PEN0_PIN_24_EN_MASK             (0x1000000U)
#define SLCD_LCD_PEN0_PIN_24_EN_SHIFT            (24U)
/*! PIN_24_EN - LCD Pin 24 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_24_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_24_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_24_EN_MASK)

#define SLCD_LCD_PEN0_PIN_25_EN_MASK             (0x2000000U)
#define SLCD_LCD_PEN0_PIN_25_EN_SHIFT            (25U)
/*! PIN_25_EN - LCD Pin 25 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_25_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_25_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_25_EN_MASK)

#define SLCD_LCD_PEN0_PIN_26_EN_MASK             (0x4000000U)
#define SLCD_LCD_PEN0_PIN_26_EN_SHIFT            (26U)
/*! PIN_26_EN - LCD Pin 26 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_26_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_26_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_26_EN_MASK)

#define SLCD_LCD_PEN0_PIN_27_EN_MASK             (0x8000000U)
#define SLCD_LCD_PEN0_PIN_27_EN_SHIFT            (27U)
/*! PIN_27_EN - LCD Pin 27 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_27_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_27_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_27_EN_MASK)

#define SLCD_LCD_PEN0_PIN_28_EN_MASK             (0x10000000U)
#define SLCD_LCD_PEN0_PIN_28_EN_SHIFT            (28U)
/*! PIN_28_EN - LCD Pin 28 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_28_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_28_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_28_EN_MASK)

#define SLCD_LCD_PEN0_PIN_29_EN_MASK             (0x20000000U)
#define SLCD_LCD_PEN0_PIN_29_EN_SHIFT            (29U)
/*! PIN_29_EN - LCD Pin 29 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_29_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_29_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_29_EN_MASK)

#define SLCD_LCD_PEN0_PIN_30_EN_MASK             (0x40000000U)
#define SLCD_LCD_PEN0_PIN_30_EN_SHIFT            (30U)
/*! PIN_30_EN - LCD Pin 30 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_30_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_30_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_30_EN_MASK)

#define SLCD_LCD_PEN0_PIN_31_EN_MASK             (0x80000000U)
#define SLCD_LCD_PEN0_PIN_31_EN_SHIFT            (31U)
/*! PIN_31_EN - LCD Pin 31 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN0_PIN_31_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN0_PIN_31_EN_SHIFT)) & SLCD_LCD_PEN0_PIN_31_EN_MASK)
/*! @} */

/*! @name LCD_PEN1 - LCD Pin Enable Register 1 */
/*! @{ */

#define SLCD_LCD_PEN1_PIN_32_EN_MASK             (0x1U)
#define SLCD_LCD_PEN1_PIN_32_EN_SHIFT            (0U)
/*! PIN_32_EN - LCD Pin 32 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_32_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_32_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_32_EN_MASK)

#define SLCD_LCD_PEN1_PIN_33_EN_MASK             (0x2U)
#define SLCD_LCD_PEN1_PIN_33_EN_SHIFT            (1U)
/*! PIN_33_EN - LCD Pin 33 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_33_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_33_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_33_EN_MASK)

#define SLCD_LCD_PEN1_PIN_34_EN_MASK             (0x4U)
#define SLCD_LCD_PEN1_PIN_34_EN_SHIFT            (2U)
/*! PIN_34_EN - LCD Pin 34 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_34_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_34_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_34_EN_MASK)

#define SLCD_LCD_PEN1_PIN_35_EN_MASK             (0x8U)
#define SLCD_LCD_PEN1_PIN_35_EN_SHIFT            (3U)
/*! PIN_35_EN - LCD Pin 35 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_35_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_35_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_35_EN_MASK)

#define SLCD_LCD_PEN1_PIN_36_EN_MASK             (0x10U)
#define SLCD_LCD_PEN1_PIN_36_EN_SHIFT            (4U)
/*! PIN_36_EN - LCD Pin 36 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_36_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_36_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_36_EN_MASK)

