zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
/*! @name LCD_BPEN1 - LCD Back Plane Enable Register 1 */
/*! @{ */

#define SLCD_LCD_BPEN1_PIN_32_BPEN_MASK          (0x1U)
#define SLCD_LCD_BPEN1_PIN_32_BPEN_SHIFT         (0U)
/*! PIN_32_BPEN - LCD Pin 32 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_32_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_32_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_32_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_33_BPEN_MASK          (0x2U)
#define SLCD_LCD_BPEN1_PIN_33_BPEN_SHIFT         (1U)
/*! PIN_33_BPEN - LCD Pin 33 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_33_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_33_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_33_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_34_BPEN_MASK          (0x4U)
#define SLCD_LCD_BPEN1_PIN_34_BPEN_SHIFT         (2U)
/*! PIN_34_BPEN - LCD Pin 34 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_34_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_34_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_34_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_35_BPEN_MASK          (0x8U)
#define SLCD_LCD_BPEN1_PIN_35_BPEN_SHIFT         (3U)
/*! PIN_35_BPEN - LCD Pin 35 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_35_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_35_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_35_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_36_BPEN_MASK          (0x10U)
#define SLCD_LCD_BPEN1_PIN_36_BPEN_SHIFT         (4U)
/*! PIN_36_BPEN - LCD Pin 36 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_36_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_36_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_36_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_37_BPEN_MASK          (0x20U)
#define SLCD_LCD_BPEN1_PIN_37_BPEN_SHIFT         (5U)
/*! PIN_37_BPEN - LCD Pin 37 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_37_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_37_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_37_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_38_BPEN_MASK          (0x40U)
#define SLCD_LCD_BPEN1_PIN_38_BPEN_SHIFT         (6U)
/*! PIN_38_BPEN - LCD Pin 38 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_38_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_38_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_38_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_39_BPEN_MASK          (0x80U)
#define SLCD_LCD_BPEN1_PIN_39_BPEN_SHIFT         (7U)
/*! PIN_39_BPEN - LCD Pin 39 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_39_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_39_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_39_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_40_BPEN_MASK          (0x100U)
#define SLCD_LCD_BPEN1_PIN_40_BPEN_SHIFT         (8U)
/*! PIN_40_BPEN - LCD Pin 40 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_40_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_40_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_40_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_41_BPEN_MASK          (0x200U)
#define SLCD_LCD_BPEN1_PIN_41_BPEN_SHIFT         (9U)
/*! PIN_41_BPEN - LCD Pin 41 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_41_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_41_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_41_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_42_BPEN_MASK          (0x400U)
#define SLCD_LCD_BPEN1_PIN_42_BPEN_SHIFT         (10U)
/*! PIN_42_BPEN - LCD Pin 42 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_42_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_42_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_42_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_43_BPEN_MASK          (0x800U)
#define SLCD_LCD_BPEN1_PIN_43_BPEN_SHIFT         (11U)
/*! PIN_43_BPEN - LCD Pin 43 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_43_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_43_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_43_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_44_BPEN_MASK          (0x1000U)
#define SLCD_LCD_BPEN1_PIN_44_BPEN_SHIFT         (12U)
/*! PIN_44_BPEN - LCD Pin 44 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_44_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_44_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_44_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_45_BPEN_MASK          (0x2000U)
#define SLCD_LCD_BPEN1_PIN_45_BPEN_SHIFT         (13U)
/*! PIN_45_BPEN - LCD Pin 45 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_45_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_45_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_45_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_46_BPEN_MASK          (0x4000U)
#define SLCD_LCD_BPEN1_PIN_46_BPEN_SHIFT         (14U)
/*! PIN_46_BPEN - LCD Pin 46 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_46_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_46_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_46_BPEN_MASK)

#define SLCD_LCD_BPEN1_PIN_47_BPEN_MASK          (0x8000U)
#define SLCD_LCD_BPEN1_PIN_47_BPEN_SHIFT         (15U)
/*! PIN_47_BPEN - LCD Pin 47 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN1_PIN_47_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN1_PIN_47_BPEN_SHIFT)) & SLCD_LCD_BPEN1_PIN_47_BPEN_MASK)
/*! @} */

/*! @name LCDWFN_LCD_WFTO - LCD Waveform 3 to 0 Register..LCD Waveform 47 to 44 Register */
/*! @{ */

