zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define SYSCON_RAM_CTRL_RAMB_CG_OVERRIDE_MASK    (0x40000U)
#define SYSCON_RAM_CTRL_RAMB_CG_OVERRIDE_SHIFT   (18U)
/*! RAMB_CG_OVERRIDE - RAMB bank clock gating control
 *  0b0..Memory bank clock is gated automatically if no access more than 16 clock cycles
 *  0b1..Auto clock gating feature is disabled
 */
#define SYSCON_RAM_CTRL_RAMB_CG_OVERRIDE(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_CTRL_RAMB_CG_OVERRIDE_SHIFT)) & SYSCON_RAM_CTRL_RAMB_CG_OVERRIDE_MASK)

#define SYSCON_RAM_CTRL_RAMC_CG_OVERRIDE_MASK    (0x80000U)
#define SYSCON_RAM_CTRL_RAMC_CG_OVERRIDE_SHIFT   (19U)
/*! RAMC_CG_OVERRIDE - RAMC bank clock gating control
 *  0b0..Memory bank clock is gated automatically if no access more than 16 clock cycles
 *  0b1..Auto clock gating feature is disabled
 */
#define SYSCON_RAM_CTRL_RAMC_CG_OVERRIDE(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_CTRL_RAMC_CG_OVERRIDE_SHIFT)) & SYSCON_RAM_CTRL_RAMC_CG_OVERRIDE_MASK)
/*! @} */

/*! @name GRAY_CODE_LSB - Gray to Binary Converter Gray Code [31:0] */
/*! @{ */

#define SYSCON_GRAY_CODE_LSB_CODE_GRAY_31_0_MASK (0xFFFFFFFFU)
#define SYSCON_GRAY_CODE_LSB_CODE_GRAY_31_0_SHIFT (0U)
/*! code_gray_31_0 - Gray code [31:0] */
#define SYSCON_GRAY_CODE_LSB_CODE_GRAY_31_0(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_GRAY_CODE_LSB_CODE_GRAY_31_0_SHIFT)) & SYSCON_GRAY_CODE_LSB_CODE_GRAY_31_0_MASK)
/*! @} */

/*! @name GRAY_CODE_MSB - Gray to Binary Converter Gray Code [41:32] */
/*! @{ */

#define SYSCON_GRAY_CODE_MSB_CODE_GRAY_41_32_MASK (0x3FFU)
#define SYSCON_GRAY_CODE_MSB_CODE_GRAY_41_32_SHIFT (0U)
/*! code_gray_41_32 - Gray code [41:32] */
#define SYSCON_GRAY_CODE_MSB_CODE_GRAY_41_32(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_GRAY_CODE_MSB_CODE_GRAY_41_32_SHIFT)) & SYSCON_GRAY_CODE_MSB_CODE_GRAY_41_32_MASK)
/*! @} */

/*! @name BINARY_CODE_LSB - Gray to Binary Converter Binary Code [31:0] */
/*! @{ */

#define SYSCON_BINARY_CODE_LSB_CODE_BIN_31_0_MASK (0xFFFFFFFFU)
#define SYSCON_BINARY_CODE_LSB_CODE_BIN_31_0_SHIFT (0U)
/*! code_bin_31_0 - Binary code [31:0] */
#define SYSCON_BINARY_CODE_LSB_CODE_BIN_31_0(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_BINARY_CODE_LSB_CODE_BIN_31_0_SHIFT)) & SYSCON_BINARY_CODE_LSB_CODE_BIN_31_0_MASK)
/*! @} */

/*! @name BINARY_CODE_MSB - Gray to Binary Converter Binary Code [41:32] */
/*! @{ */

#define SYSCON_BINARY_CODE_MSB_CODE_BIN_41_32_MASK (0x3FFU)
#define SYSCON_BINARY_CODE_MSB_CODE_BIN_41_32_SHIFT (0U)
/*! code_bin_41_32 - Binary code [41:32] */
#define SYSCON_BINARY_CODE_MSB_CODE_BIN_41_32(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_BINARY_CODE_MSB_CODE_BIN_41_32_SHIFT)) & SYSCON_BINARY_CODE_MSB_CODE_BIN_41_32_MASK)
/*! @} */

/*! @name ELS_UDF - UDF Control */
/*! @{ */

#define SYSCON_ELS_UDF_KEY_SEL_MASK              (0x3U)
#define SYSCON_ELS_UDF_KEY_SEL_SHIFT             (0U)
/*! KEY_SEL - UDF KEY Select
 *  0b00, 0b01..DUK: UID[127:0]^RTL_CONST1[127:0]
 *  0b10..DeviceHSM
 *  0b11..NXP_mRoT
 */
#define SYSCON_ELS_UDF_KEY_SEL(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_UDF_KEY_SEL_SHIFT)) & SYSCON_ELS_UDF_KEY_SEL_MASK)

#define SYSCON_ELS_UDF_UID_HIDDEN_MASK           (0xF000000U)
#define SYSCON_ELS_UDF_UID_HIDDEN_SHIFT          (24U)
/*! UID_HIDDEN - UID register hidden control. Write values other than 1010b, locked the write of UID_HIDDEN until a system reset.
 *  0b1010..Enable the access of UID[127:0] register. All other value, disable the read/write of UID[127:0] register.
 */
#define SYSCON_ELS_UDF_UID_HIDDEN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_UDF_UID_HIDDEN_SHIFT)) & SYSCON_ELS_UDF_UID_HIDDEN_MASK)

#define SYSCON_ELS_UDF_UDF_HIDDEN_MASK           (0xF0000000U)
#define SYSCON_ELS_UDF_UDF_HIDDEN_SHIFT          (28U)
/*! UDF_HIDDEN - UDF register hidden control. Write values other than 1010b, locked the write of UDF_HIDDEN until a system reset.
 *  0b1010..Enable the access of UDF register from APB bus. All other value, disable the read/write of UDF register from UDF APB bus.
 */
#define SYSCON_ELS_UDF_UDF_HIDDEN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_UDF_UDF_HIDDEN_SHIFT)) & SYSCON_ELS_UDF_UDF_HIDDEN_MASK)
/*! @} */

/*! @name MSFCFG - MSF Configuration */
/*! @{ */

#define SYSCON_MSFCFG_IFR_ERASE_DIS0_MASK        (0x1U)
#define SYSCON_MSFCFG_IFR_ERASE_DIS0_SHIFT       (0U)
/*! IFR_ERASE_DIS0 - user IFR sector 0 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SYSCON_MSFCFG_IFR_ERASE_DIS0(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_MSFCFG_IFR_ERASE_DIS0_SHIFT)) & SYSCON_MSFCFG_IFR_ERASE_DIS0_MASK)

#define SYSCON_MSFCFG_IFR_ERASE_DIS1_MASK        (0x2U)
#define SYSCON_MSFCFG_IFR_ERASE_DIS1_SHIFT       (1U)
/*! IFR_ERASE_DIS1 - user IFR sector 1 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SYSCON_MSFCFG_IFR_ERASE_DIS1(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_MSFCFG_IFR_ERASE_DIS1_SHIFT)) & SYSCON_MSFCFG_IFR_ERASE_DIS1_MASK)

#define SYSCON_MSFCFG_IFR_ERASE_DIS2_MASK        (0x4U)
#define SYSCON_MSFCFG_IFR_ERASE_DIS2_SHIFT       (2U)
/*! IFR_ERASE_DIS2 - user IFR sector 2 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SYSCON_MSFCFG_IFR_ERASE_DIS2(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_MSFCFG_IFR_ERASE_DIS2_SHIFT)) & SYSCON_MSFCFG_IFR_ERASE_DIS2_MASK)

#define SYSCON_MSFCFG_IFR_ERASE_DIS3_MASK        (0x8U)
#define SYSCON_MSFCFG_IFR_ERASE_DIS3_SHIFT       (3U)
/*! IFR_ERASE_DIS3 - user IFR sector 3 erase control
 *  0b0..Enable IFR sector erase.
 *  0b1..Disable IFR sector erase, write one lock until a system reset.
 */
#define SYSCON_MSFCFG_IFR_ERASE_DIS3(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_MSFCFG_IFR_ERASE_DIS3_SHIFT)) & SYSCON_MSFCFG_IFR_ERASE_DIS3_MASK)

#define SYSCON_MSFCFG_MASS_ERASE_DIS_MASK        (0x100U)
#define SYSCON_MSFCFG_MASS_ERASE_DIS_SHIFT       (8U)
/*! MASS_ERASE_DIS - Mass erase control
 *  0b0..Enables mass erase
 *  0b1..Disables mass erase, write one lock until a system reset.
 */
#define SYSCON_MSFCFG_MASS_ERASE_DIS(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_MSFCFG_MASS_ERASE_DIS_SHIFT)) & SYSCON_MSFCFG_MASS_ERASE_DIS_MASK)
/*! @} */

/*! @name ELS_UIDX_ELS_UID - Device UID 0..Device UID 3 */
/*! @{ */

#define SYSCON_ELS_UIDX_ELS_UID_UID0_MASK        (0xFFFFFFFFU)
#define SYSCON_ELS_UIDX_ELS_UID_UID0_SHIFT       (0U)
/*! UID0 - UID */
#define SYSCON_ELS_UIDX_ELS_UID_UID0(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_UIDX_ELS_UID_UID0_SHIFT)) & SYSCON_ELS_UIDX_ELS_UID_UID0_MASK)

