zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/MCXA276.h
#define TRNG_INT_CTRL_HW_ERR_MASK                (0x1U)
#define TRNG_INT_CTRL_HW_ERR_SHIFT               (0U)
/*! HW_ERR
 *  0b0..Clears the INT_STATUS[HW_ERR] bit. Will automatically set after writing.
 *  0b1..Enables the INT_STATUS[HW_ERR] bit to be set, thereby enabling interrupt generation for the HW_ERR condition.
 */
#define TRNG_INT_CTRL_HW_ERR(x)                  (((uint32_t)(((uint32_t)(x)) << TRNG_INT_CTRL_HW_ERR_SHIFT)) & TRNG_INT_CTRL_HW_ERR_MASK)

#define TRNG_INT_CTRL_ENT_VAL_MASK               (0x2U)
#define TRNG_INT_CTRL_ENT_VAL_SHIFT              (1U)
/*! ENT_VAL
 *  0b0..Clears the INT_STATUS[ENT_VAL] bit. Will automatically set after writing.
 *  0b1..Enables the INT_STATUS[ENT_VAL] bit to be set, thereby enabling interrupt generation for the ENT_VAL condition.
 */
#define TRNG_INT_CTRL_ENT_VAL(x)                 (((uint32_t)(((uint32_t)(x)) << TRNG_INT_CTRL_ENT_VAL_SHIFT)) & TRNG_INT_CTRL_ENT_VAL_MASK)

#define TRNG_INT_CTRL_FRQ_CT_FAIL_MASK           (0x4U)
#define TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT          (2U)
/*! FRQ_CT_FAIL
 *  0b0..Clears the INT_STATUS[FRQ_CT_FAIL] bit. Will automatically set after writing.
 *  0b1..Enables the INT_STATUS[FRQ_CT_FAIL] bit to be set, thereby enabling interrupt generation for the FRQ_CT_FAIL condition.
 */
#define TRNG_INT_CTRL_FRQ_CT_FAIL(x)             (((uint32_t)(((uint32_t)(x)) << TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT)) & TRNG_INT_CTRL_FRQ_CT_FAIL_MASK)

#define TRNG_INT_CTRL_INTG_FLT_MASK              (0x8U)
#define TRNG_INT_CTRL_INTG_FLT_SHIFT             (3U)
/*! INTG_FLT
 *  0b0..Clears the INT_STATUS[INTG_FLT] bit. Will automatically set after writing.
 *  0b1..Enables the INT_STATUS[INTG_FLT] bit to be set, thereby enabling interrupt generation for the INTG_FLT condition.
 */
#define TRNG_INT_CTRL_INTG_FLT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_INT_CTRL_INTG_FLT_SHIFT)) & TRNG_INT_CTRL_INTG_FLT_MASK)
/*! @} */

/*! @name INT_MASK - Mask Register */
/*! @{ */

#define TRNG_INT_MASK_HW_ERR_MASK                (0x1U)
#define TRNG_INT_MASK_HW_ERR_SHIFT               (0U)
/*! HW_ERR
 *  0b0..HW_ERR interrupt is disabled.
 *  0b1..HW_ERR interrupt is enabled.
 */
#define TRNG_INT_MASK_HW_ERR(x)                  (((uint32_t)(((uint32_t)(x)) << TRNG_INT_MASK_HW_ERR_SHIFT)) & TRNG_INT_MASK_HW_ERR_MASK)

#define TRNG_INT_MASK_ENT_VAL_MASK               (0x2U)
#define TRNG_INT_MASK_ENT_VAL_SHIFT              (1U)
/*! ENT_VAL
 *  0b0..ENT_VAL interrupt is disabled.
 *  0b1..ENT_VAL interrupt is enabled.
 */
#define TRNG_INT_MASK_ENT_VAL(x)                 (((uint32_t)(((uint32_t)(x)) << TRNG_INT_MASK_ENT_VAL_SHIFT)) & TRNG_INT_MASK_ENT_VAL_MASK)

#define TRNG_INT_MASK_FRQ_CT_FAIL_MASK           (0x4U)
#define TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT          (2U)
/*! FRQ_CT_FAIL
 *  0b0..FRQ_CT_FAIL interrupt is disabled.
 *  0b1..FRQ_CT_FAIL interrupt is enabled.
 */
#define TRNG_INT_MASK_FRQ_CT_FAIL(x)             (((uint32_t)(((uint32_t)(x)) << TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT)) & TRNG_INT_MASK_FRQ_CT_FAIL_MASK)

#define TRNG_INT_MASK_INTG_FLT_MASK              (0x8U)
#define TRNG_INT_MASK_INTG_FLT_SHIFT             (3U)
/*! INTG_FLT
 *  0b0..INTG_FLT interrupt is disabled.
 *  0b1..INTG_FLT interrupt is enabled.
 */
#define TRNG_INT_MASK_INTG_FLT(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_INT_MASK_INTG_FLT_SHIFT)) & TRNG_INT_MASK_INTG_FLT_MASK)
/*! @} */

/*! @name INT_STATUS - Interrupt Status Register */
/*! @{ */

#define TRNG_INT_STATUS_HW_ERR_MASK              (0x1U)
#define TRNG_INT_STATUS_HW_ERR_SHIFT             (0U)
/*! HW_ERR
 *  0b0..No error.
 *  0b1..Error detected.
 */
#define TRNG_INT_STATUS_HW_ERR(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_INT_STATUS_HW_ERR_SHIFT)) & TRNG_INT_STATUS_HW_ERR_MASK)

#define TRNG_INT_STATUS_ENT_VAL_MASK             (0x2U)
#define TRNG_INT_STATUS_ENT_VAL_SHIFT            (1U)
/*! ENT_VAL
 *  0b0..Busy generating entropy. Any value read from the Entropy registers is invalid.
 *  0b1..Values read from the Entropy registers are valid.
 */
#define TRNG_INT_STATUS_ENT_VAL(x)               (((uint32_t)(((uint32_t)(x)) << TRNG_INT_STATUS_ENT_VAL_SHIFT)) & TRNG_INT_STATUS_ENT_VAL_MASK)

#define TRNG_INT_STATUS_FRQ_CT_FAIL_MASK         (0x4U)
#define TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT        (2U)
/*! FRQ_CT_FAIL
 *  0b0..No hardware nor self test frequency errors.
 *  0b1..The frequency counter has detected a failure.
 */
#define TRNG_INT_STATUS_FRQ_CT_FAIL(x)           (((uint32_t)(((uint32_t)(x)) << TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT)) & TRNG_INT_STATUS_FRQ_CT_FAIL_MASK)

#define TRNG_INT_STATUS_INTG_FLT_MASK            (0x8U)
#define TRNG_INT_STATUS_INTG_FLT_SHIFT           (3U)
/*! INTG_FLT
 *  0b0..No internal fault has been detected.
 *  0b1..TRNG has detected internal fault.
 */
#define TRNG_INT_STATUS_INTG_FLT(x)              (((uint32_t)(((uint32_t)(x)) << TRNG_INT_STATUS_INTG_FLT_SHIFT)) & TRNG_INT_STATUS_INTG_FLT_MASK)
/*! @} */

/*! @name CSER - Common Security Error Register */
/*! @{ */

#define TRNG_CSER_RED_SIGS_MASK                  (0x1U)
#define TRNG_CSER_RED_SIGS_SHIFT                 (0U)
/*! RED_SIGS - Redundant Signals error/fault Detected
 *  0b0..No redundant signal error/fault
 *  0b1..Redundant signal error/fault detected.
 */
#define TRNG_CSER_RED_SIGS(x)                    (((uint32_t)(((uint32_t)(x)) << TRNG_CSER_RED_SIGS_SHIFT)) & TRNG_CSER_RED_SIGS_MASK)

#define TRNG_CSER_RED_FSM_MASK                   (0x2U)
#define TRNG_CSER_RED_FSM_SHIFT                  (1U)
/*! RED_FSM - Redundant FSM error/fault detected
 *  0b0..No redundant FSM error/fault
 *  0b1..Redundant FSM error/fault detected.
 */
#define TRNG_CSER_RED_FSM(x)                     (((uint32_t)(((uint32_t)(x)) << TRNG_CSER_RED_FSM_SHIFT)) & TRNG_CSER_RED_FSM_MASK)

#define TRNG_CSER_LOCAL_EDC_MASK                 (0x4U)
#define TRNG_CSER_LOCAL_EDC_SHIFT                (2U)
/*! LOCAL_EDC - Local-EDC error/fault detected
 *  0b0..No Local-EDC error/fault detected.
 *  0b1..Local-EDC error/fault detected.
 */
#define TRNG_CSER_LOCAL_EDC(x)                   (((uint32_t)(((uint32_t)(x)) << TRNG_CSER_LOCAL_EDC_SHIFT)) & TRNG_CSER_LOCAL_EDC_MASK)

#define TRNG_CSER_BUS_EDC_MASK                   (0x8U)
#define TRNG_CSER_BUS_EDC_SHIFT                  (3U)
/*! BUS_EDC - Bus-EDC error/fault detected
 *  0b0..No Bus-EDC error/fault detected.
 *  0b1..Bus-EDC error/fault detected.
 */
#define TRNG_CSER_BUS_EDC(x)                     (((uint32_t)(((uint32_t)(x)) << TRNG_CSER_BUS_EDC_SHIFT)) & TRNG_CSER_BUS_EDC_MASK)
/*! @} */

/*! @name CSCLR - Common Security Clear Register */
/*! @{ */

#define TRNG_CSCLR_RED_SIGS_CLR_MASK             (0x1U)
#define TRNG_CSCLR_RED_SIGS_CLR_SHIFT            (0U)
/*! RED_SIGS_CLR - Redundant Signals error/fault Detected
 *  0b0..No effect, ignored
 *  0b1..Clears the CSER[RED_SIGS] bit.
 */
#define TRNG_CSCLR_RED_SIGS_CLR(x)               (((uint32_t)(((uint32_t)(x)) << TRNG_CSCLR_RED_SIGS_CLR_SHIFT)) & TRNG_CSCLR_RED_SIGS_CLR_MASK)

#define TRNG_CSCLR_RED_FSM_CLR_MASK              (0x2U)
#define TRNG_CSCLR_RED_FSM_CLR_SHIFT             (1U)
/*! RED_FSM_CLR
 *  0b0..No effect, ignored
 *  0b1..Clears the CSER[RED_FSM] bit.
 */
#define TRNG_CSCLR_RED_FSM_CLR(x)                (((uint32_t)(((uint32_t)(x)) << TRNG_CSCLR_RED_FSM_CLR_SHIFT)) & TRNG_CSCLR_RED_FSM_CLR_MASK)

#define TRNG_CSCLR_LOCAL_EDC_CLR_MASK            (0x4U)
#define TRNG_CSCLR_LOCAL_EDC_CLR_SHIFT           (2U)
/*! LOCAL_EDC_CLR
 *  0b0..No effect, ignored
 *  0b1..Clears the CSER[LOCAL_EDC] bit.
 */
#define TRNG_CSCLR_LOCAL_EDC_CLR(x)              (((uint32_t)(((uint32_t)(x)) << TRNG_CSCLR_LOCAL_EDC_CLR_SHIFT)) & TRNG_CSCLR_LOCAL_EDC_CLR_MASK)

